{
    "schools": {
        "9-12 Schools": [
            {
                "SchoolID": 301,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with Pre-Engineering Magnet and CTE Offerings",
                "SiteUrl": "allderdice",
                "Fax": "4122246074",
                "SchoolDescription": "<p>Pittsburgh Allderdice High School is a neighborhood school with a partial Engineering Magnet program.&nbsp; Allderdice is located in Pittsburgh&rsquo;s Squirrel Hill community with a culturally diverse student body and a reputation for rigorous college preparatory classes. Approximately 1,500 students attend the school, from diverse communities throughout the city of Pittsburgh.&nbsp;</p>\n\n<p>Pittsburgh Allderdice has a culture of high achievement, well-roundedness, and celebrating diversity.&nbsp; There are a wide array of academic programs that are offered at the gifted (CAS) level.&nbsp; The Engineering Magnet program encourages students to work individually to learn scientific principles and then work in groups to apply what they have learned to hands-on projects. The program develops skills in critical thinking, problem solving, oral presentation, data analysis, technical writing, CAD and other engineering software. Allderdice has numerous math, science, Career and Technical Education (CTE) options for students to complement their engineering classes and strengthen their college preparedness and Promise-Readiness. In the Pre-Engineering Magnet program at Allderdice, students will analyze problems, design and build solutions, test their products and present their creations. Students will have access to mentoring, career seminars and enriching programs that extend their learning from the classroom to the workplace for exposure to engineering careers.</p>\n\n<p>In order to meet all of our students&rsquo; needs, we offer Promise Ready Corps for all 9th&nbsp;and 10th&nbsp;grade students.&nbsp; Our CTE program offers HVAC training and certification for interested students. To complement its academic programs, Pittsburgh Allderdice offers a full range of interscholastic, intramural, and co-curricular clubs reflecting the diversity of its students&#39; backgrounds and interests.&nbsp; Parent and community stakeholders play a critical role in our daily work. Pittsburgh Allderdice is generously supported by active groups of parents, alumni, and business and community organizations. Current support includes ongoing Partnerships in Education with Carnegie Mellon University, the University of Pittsburgh and the University of Pittsburgh Medical Center.&nbsp; Pittsburgh Allderdice High School provides many opportunities to encourage parents to partner with us in their child&rsquo;s education through parent conferences, open house, &ldquo;Back to School Night&rdquo;, &ldquo;Discover Allderdice&rdquo;, and other family events.&nbsp; Our Parent School Community Council (PSCC) meets monthly and includes parents and members of community organizations.&nbsp; The benefits to our students from these partnerships are invaluable and have provided these organizations the opportunity to become a part of our school.</p>\n\n<p>Pittsburgh Allderdice High School commits to provide an environment where all students can achieve academic excellence and excel in all aspects of life while being challenged to reach high academic standards, become lifelong learners and contributing members of their current and future communities.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Advanced Placement Courses Offered:</strong></p>\n\n<p>Art History, Biology, Calculus AB, Calculus BC, Chemistry, Computer Science, Computer Science Principles, &nbsp;English 3, English 4, Environmental Science, European History, French, Human Geography, Japanese, Microeconomics, Music Theory, Physics 1, Physics C: Mechanics, Physics C: Electricity &amp; Magnetism, Psychology, Research, AP Seminar, Spanish 5, Spanish 6, Statistics, Studio Art, US History, US Government &amp; Politics, World History</p>\n\n<p>&nbsp;</p>\n\n<p><strong>CTE Programs Offered:</strong></p>\n\n<p>Engineering Technology and HVAC</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Autistic Support Classroom</p>\n",
                "SchoolAlertBox": "<p><big>Are you interested in receiving weekly newsletters from the school? <strong><a href=\"http://visitor.r20.constantcontact.com/d.jsp?llr=saoa98nab&amp;p=oi&amp;m=1114403518482&amp;sit=64k7bkbib\">Sign up</a></strong> for our e-bulletins that provide information regarding upcoming events, sports, activities and so much more.&nbsp;</big></p>\n",
                "GoogleCalendarID": "hp1aum3tucnum1m87h230j2dag@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/Allderdice-Student-Services-1411342492453233/",
                "TwitterURL": "https://twitter.com/DocMcCoyAtDice",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://allderdicepto.org/",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "https://visitor.r20.constantcontact.com/manage/optin?v=001RasWx_M1beunmIFemD24Ln5LYzvnrd2t1P4GFY9aU1n_Ms3T92yuKvs9YM_3MNrCprxfDJeqrX1_e8RVWzouPYGo5THDmjYmAiByD8smRaj4n97TmjQITw%3D%3D",
                "StarSchool": "0",
                "StateID": "409",
                "SchoolTypeID": "6",
                "AddressLine1": "2409 Shady Ave",
                "AddressLine2": null,
                "SchoolName": "Allderdice High School",
                "Zip": "15217",
                "Phone": "4125294800",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "7:36AM",
                "EndTime": "2:46PM",
                "dwSchoolID": "301",
                "AverageClassSize": null,
                "DistrictID": "4",
                "Mascot": "Know something, do something, be something.",
                "Uniform": "No",
                "SchoolColors": "Green and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/cbf08ed79b804136b05c22388b2300df12205286215728115548/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=148463&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-09-06 14:18:42.000",
                "history": null
            },
            {
                "SchoolID": 329,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with Teaching Academy Magnet and CTE Offerings",
                "SiteUrl": "brashear",
                "Fax": "4125717305",
                "SchoolDescription": "<p>Pittsburgh Brashear High School is a neighborhood school with a partial Teaching Academy Magnet program located in Pittsburgh&#39;s Beechview community. The mission of Pittsburgh Brashear is to produce productive members of society by providing quality instruction, academic rigor, and racial equity. Brashear will accomplish this mission by empowering students, teachers, parents, administrators and community stakeholders to collaborate on the best ways to achieve success for all students. High academic expectations are essential, and the goal is that all students will take at least one advanced placement (AP) course prior to graduation. Pittsburgh Brashear High School has a College-Ready culture that supports strong behaviors and habits necessary for work and life beyond high school. The Brashear Teaching Academy Magnet program is for students who have indicated an interest in the teaching profession. However, it is not expected that all of the students enrolled in the course have committed irrevocably to a teaching career. The program is introductory and exploratory, and it is specifically designed to help students develop a wide range of skills. By developing these skills, students will have a clear self-image and the ability to evaluate their own suitability for any career.</p>\n\n<p>&nbsp;</p>\n\n<p>The school has a National Math and Science Initiative Grant to increase the number of Advanced Placement offerings and to provide AP incentives to students. The library houses an extensive computerized collection for circulation with a state of the art computer lab for research. All classes have ELMO&#39;s and LCD projectors. All 9th and 10th grade core classes are equipped with SMART Boards. Activities at Brashear High School include Student Government, interscholastic and intramural sports (for both males and females), mathematics, literacy and science competitions, including a Hometown High-Q team, and more than 25 other clubs. Brashear offers intensive community service and leadership activities as well. All of these opportunities are available with the intent to educate students in a number of ways and to truly prepare them for life after high school.</p>\n\n<p>&nbsp;</p>\n\n<p>English Language Learners have the option of participating in the school&#39;s entire course offerings including sheltered content classes that provide more language support based on students&#39; language proficiency.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Advanced Placement Courses Offered:</strong></p>\n\n<p>Biology, Calculus AB, Chemistry, Computer Science, English 3, English 4, Environmental Science, European History, Physics 1, Physics 2, Psychology, Statistics, US History, World History</p>\n\n<p>&nbsp;</p>\n\n<p><strong>CTE Programs Offered:</strong></p>\n\n<p>Auto Body Repair, Automotive Technology, Machine Operations, Multimedia Production &amp; Coding</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Autistic Support Classroom, Regional Hearing Impaired Support Classroom, Regional Visually Impaired Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "<p><em>Are you interested in receiving weekly newsletters from the school?</em><strong> <a href=\"https://visitor.r20.constantcontact.com/d.jsp?llr=igk7a5qab&amp;p=oi&amp;m=1117699057864&amp;sit=8bpvw99ib&amp;f=9294c128-e482-4a79-ab2f-60d4dceb6c7c\" target=\"_blank\">Sign up</a></strong> for our e-bulletins that provide information regarding upcoming events, sports, activities and so much more. Text <strong>Bulls</strong> to 22828 to sign up.&nbsp;</p>\n",
                "GoogleCalendarID": "fc3t3l6j17e5cs5oesirnrnp1s@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/BrashearHS",
                "TwitterURL": "https://twitter.com/BrashearHS",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "https://pittsburghbrashear.com/",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6915",
                "SchoolTypeID": "6",
                "AddressLine1": "590 Crane Ave",
                "AddressLine2": null,
                "SchoolName": "Brashear High School",
                "Zip": "15216",
                "Phone": "4125297300",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "7:40AM",
                "EndTime": "3:22PM",
                "dwSchoolID": "329",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "We have loved the stars too fondly to be fearful of the night.",
                "Uniform": "No",
                "SchoolColors": "Black and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/104cf9efc7f24ba7a9cbb69f3f0f56d310762263239213790910/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18078&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-01-17 13:40:10.000",
                "history": null
            },
            {
                "SchoolID": 305,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with CTE Offerings",
                "SiteUrl": "carrick",
                "Fax": "4128857708",
                "SchoolDescription": "<p>Pittsburgh Carrick High School is a comprehensive neighborhood school located in Pittsburgh&#39;s Carrick community. Our mission is to ensure that all graduates are &quot;Promise-Ready&quot; and prepared with a plan for school, work, or additional training. A dedicated faculty and staff include several National Board Certified Teachers and Evaluators. In addition to programs at the Advanced Placement (AP), gifted (CAS), scholars (PSP), Special Education (PSE), and standard academic levels, Carrick offers a variety of Career and Technical Education (CTE) programs. Students who complete the CTE programs in accordance with the Chapter 339 programming and time requirements may obtain the CTE certification.</p>\n\n<p>Pittsburgh Carrick High School offers a full range of interscholastic, intramural, and co-curricular clubs including varsity sports, school plays, marching band, steel drums, indoor guard, majorettes, percussion competition units, and community service projects. Students have an opportunity to participate in a variety of academic competitions such as the African American History Bowl. A strong, award-winning arts program is supported by partnerships with Manchester Craftsmen&#39;s Guild. Pittsburgh Carrick&#39;s Marching Band has been named the &quot;Best City Band&quot; for the Labor Day, St. Patrick&#39;s Day, and Veteran&#39;s Day Parades.</p>\n\n<p><strong>Advanced Placement Courses Offered: </strong></p>\n\n<p>Calculus AB, Chemistry, English 3, English 4, Psychology, Statistics, US History</p>\n\n<p><strong>CTE Programs Offered: </strong></p>\n\n<p>Carpentry, Culinary Arts, Finance Technology, Health Careers, Information Technology</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Autistic Support Classroom</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "03a48t6fukhqb7oth8rletti8o@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pittsburghcarrickhighschoolactivities/",
                "TwitterURL": "https://twitter.com/PghCarrickHS/",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "http://www.chscarrickulum.com/",
                "StarSchool": "0",
                "StateID": "412",
                "SchoolTypeID": "6",
                "AddressLine1": "125 Parkfield St",
                "AddressLine2": null,
                "SchoolName": "Carrick High School",
                "Zip": "15210",
                "Phone": "4125297700",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "7:33AM",
                "EndTime": "3:09PM",
                "dwSchoolID": "305",
                "AverageClassSize": null,
                "DistrictID": "7",
                "Mascot": "Alma Mater: Carrick High, we love you dearly. You're our pride and you're our joy. You hold a sacred spot within the heart of every girl and boy. We'll honor you forever. We'll be loyal 'till we die. You always can depend on us, our dear old Carrick High.",
                "Uniform": "No",
                "SchoolColors": "Blue and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/9f81d48994c24c469afb1f5bb9b136cf17271716832808317742/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18081&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-10-30 10:28:51.000",
                "history": null
            },
            {
                "SchoolID": 319,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with Traditional Academy Magnet and CTE Offerings",
                "SiteUrl": "perry",
                "Fax": "4123233404",
                "SchoolDescription": "<div><!--block-->Pittsburgh Perry Traditional Academy is a partial magnet school that focuses on developing the whole adolescent. We believe that a great emphasis on academics, attendance, and positive behavior will provide opportunities for all students to achieve at their maximum level.</div><div><!--block-->&nbsp;</div><div><!--block--><strong>Advanced Placement Courses Offered:</strong></div><div><!--block-->Calculus AB, Chemistry, Computer Science Principles, English 3, English 4, US History, World History</div><div><!--block--><br><br></div><div><!--block--><strong>CTE Programs Offered:</strong></div><div><!--block-->Cosmetology, Health Careers, Information Technology<br><br></div><div><!--block--><br></div><div><!--block--><strong>Additional Educational Services:</strong></div><div><!--block-->Autistic Support, Emotional Support, Itinerant Hearing and Vision, Learning Support, Life Skills, Occupation and Physical Therapy, Speech &amp; Language</div>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "0ci5rcev51t6k4mj2gldh1ivco@group.calendar.google.com",
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/pages/Perry-Traditional-Academy/117317378319201",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "416",
                "SchoolTypeID": "6",
                "AddressLine1": "3875 Perrysville Ave",
                "AddressLine2": null,
                "SchoolName": "Perry High School",
                "Zip": "15214",
                "Phone": "4125293400",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "7:00AM",
                "EndTime": "2:10PM",
                "dwSchoolID": "319",
                "AverageClassSize": null,
                "DistrictID": "9",
                "Mascot": null,
                "Uniform": null,
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/76c9142ca35744919aa68b253537f9c017636054603729040411/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=148465&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-09-19 12:50:54.907",
                "history": "Perry School was named for its community, which is generally known as Perry Hilltop, buy also traces its name to Commodore Oliver H. Perry. The school's string and Neoclassical styling make it one of Pittsburgh's most monumental school buildings, and a prominent representative of the high school building boom of the 1920s. Robery Maurice Trimble designed both the 1921 school building and the 1925 addition. The 1921 building included an auditorium and stage gym in the corner pavilion while the 1925 addition proided a new gymnasium, a cafeteria, and shop rooms. Perry High School is similiar to Trimble's Taylor Allderdice School (on the National Register) in its bulk, Classical styling, and commanding site."
            }
        ],
        "6-8 Schools": [
            {
                "SchoolID": 204,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "A Traditional Academy Magnet",
                "SiteUrl": "allegheny6-8",
                "Fax": "4123234114",
                "SchoolDescription": "<p>Where Every Challenge is an Opportunity! Pittsburgh Allegheny 6-8 is a whole school Traditional Academy Magnet School located in Pittsburgh&#39;s North Side community. It sits in a prime location that provides teachers and students the opportunity to partner with the Children&#39;s Museum of Pittsburgh, The National Aviary, Carnegie Science Center, Community College of Allegheny County, Carnegie Library, The Pittsburgh Steelers Football, and the Pittsburgh Pirates Baseball teams. Our school emphasizes academic achievement, structure, discipline, character development, technology proficiency, and community responsibility. We embrace the Community of Caring Core Values of Responsibility, Respect, Trust, Care, and Family. Our children will behave appropriately, respect cultural diversity, and will develop self-discipline, self-confidence, and self-reliance. Student affirmation will result in proud and successful children. Students will provide service to their schools and the community. Parents will support the philosophy and practices of the Traditional Academy, and will be engaged as partners in the education of their children. Teachers and administrators will fine tune skills and seek professional development opportunities to improve their effectiveness. Collaborative efforts of educators, parents and the community help us to achieve our goals for all our students.</p>\n\n<p>All students have equitable access to instructional technology, which includes: ActivBoard, Read 180, Compass Learning Reading and Math programs, and classroom computers, as well as a fully equipped computer lab. Other special programs for students include: Pittsburgh Gifted Program, Title I school wide program, learning support classes, school-wide positive behavior support system, Student Assistant Program, and conflict mediation.</p>\n\n<p>Pittsburgh Allegheny 6-8 also offers opportunities to participate in choral and instrumental ensembles, grade level service learning projects, portfolio review, extended day program, book clubs, Science Fair, Pennsylvania Junior Academy of Science Competition, Career Day, participation in the African American Challenge Bowl, and recently received the NFL Play 60 Fitness grant. Sports include interscholastic volleyball, cross-country, basketball, swimming, soccer, and wrestling. Other activities include intramural sports, National Junior Honor Society, Step Team, the Mayor&#39;s Stash the Trash Campaign, Yearbook Club, K.R.U.N.K., ASSEMBLE, S.T.E.M. Stars, Youth Places, Digital Corps, and School Newspaper Club. School-community partnerships include Mercy Behavioral Health, Pittsburgh Children&#39;s Museum, Sprout, Pittsburgh Project, the Carnegie Science Center, and the National Aviary.</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n\n\n<iframe src=\"https://player.vimeo.com/video/348899645\" width=\"540\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe> <p><a href=\"https://vimeo.com/348899645\">Discover Pittsburgh Allegheny 6-8</a> from <a href=\"https://vimeo.com/pghschools\">Pittsburgh Public Schools</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "42rv7simaksl11kmmdg22fa1p0@group.calendar.google.com",
                "StaffWebpageURL": "http://www.pps.k12.pa.us/site/Default.aspx?PageType=1&SiteID=866&ChannelID=881&DirectoryType=6",
                "FacebookURL": "https://www.facebook.com/pages/Pittsburgh-Allegheny-6-8/147146365378531",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7616",
                "SchoolTypeID": "4",
                "AddressLine1": "810 Arch St",
                "AddressLine2": null,
                "SchoolName": "Allegheny 6-8",
                "Zip": "15212",
                "Phone": "4125294115",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:10AM",
                "EndTime": "3:47PM",
                "dwSchoolID": "204",
                "AverageClassSize": null,
                "DistrictID": "8",
                "Mascot": "Allegheny Astros",
                "Uniform": "Khaki or navy blue pants, shorts, skirts and dresses. White, light blue or navy shirts.",
                "SchoolColors": "Blue and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/96273d983d5c4ae294dfd5514e569247465790972804741712/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18072&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-09-09 12:10:36.000",
                "history": null
            },
            {
                "SchoolID": 298,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "arsenalms",
                "Fax": "4126225743",
                "SchoolDescription": "<p>Pittsburgh Arsenal 6-8 is a small neighborhood school that provides all of the educational resources and opportunities of a comprehensive middle school in Pittsburgh&#39;s Lawrenceville community. Our students represent over twenty-six countries including Kenya, Somalia, Burundi, and Mexico and provide a diverse student population where students learn to acknowledge and appreciate various cultures. At Arsenal, students work together and develop leadership skills that prepare them for the Pittsburgh Promise. Every student is provided a challenging curriculum that teaches the habits of mind necessary for higher achievement in all content areas. While all students enter Arsenal with varying levels of achievement, our goal is to strengthen and grow every student&#39;s academic performance in preparation for high school.</p>\n\n<p>&nbsp;</p>\n\n<p>Students at Pittsburgh Arsenal 6-8 are provided intensive enrichment and academic support to increase reading and math proficiency. Students have access to Read 180 and 90-minute English/Language Arts classes, as well as in-school tutoring programs that allow teachers additional time to focus on individual student needs. Our students have demonstrated consistent success in mathematics and have access to Algebra 1, as well as computer-based learning opportunities to strengthen basic skills. In addition to our core curriculum classes, students also have the opportunity to enroll in Art, Music, and Physical Education for a balanced scheduled that includes a focus on health and art appreciation. Pittsburgh Arsenal 6-8 is an English as a Second Language (ESL) regional center and provides support for students new to the English Language while providing access to the mainstream curriculum.</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Arsenal 6-8 offers a complete sports program including basketball, soccer, cross-country, volleyball, swimming, and wrestling. In addition, Arsenal 6-8 offers after school activities in Art, Music and Technology through various community partnerships. Mentoring is also available through Big Brothers/Big Sister&#39;s during lunch each week for any interested student in grades 6-8. East End Cooperative Ministries also offers mentoring that extends beyond the school day into community. Arsenal 6-8 is also focused on positive self-image and healthy decisions. We maintain a Health Rangers program through Children&#39;s Hospital and have on-site access to Children&#39;s Nurses and services. Mercy Behavioral Health and Family Links provide a variety of social skills groups and therapeutic options to assist students in need.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "3r661o9iqptmg56lofptq312p8@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Arsenal-Middle-School/103426309748778",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "1",
                "StateID": "7886",
                "SchoolTypeID": "4",
                "AddressLine1": "220 40th Street",
                "AddressLine2": null,
                "SchoolName": "Arsenal 6-8",
                "Zip": "15201",
                "Phone": "4125295740",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:51PM",
                "dwSchoolID": "298",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": "Patriots",
                "Uniform": "No",
                "SchoolColors": "Red and Black",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/408fb924aa3a42b78bc50ad4d047dcca14291746588665846335/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18075&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-07-17 15:31:51.000",
                "history": "Arsenal School was built on a site acquired by the Board of Publice Education in a 1921 land swap, but construction did not begin until 1931. the original school building was L-shaped and served as a junior high school. The west wing was added in 1939 to house an elementary school. The building surrounds a prominently sited playing field with its light standards and grandstands. Arsenal School's Classical styling, which gives way at some point to Art Deco motifs, encloses one of the Pittsburgh public school's most ornate interiors in the auditorium and its forecourt hallway. The architect for the original building was the firm of Schwab, Palmgreen & Merrick. M.M. Steen officially designed the later west wing. This section, however, had been anticipated in the original plan, and Steen's work closely matched the existing building. Thus, Schwab, Palmgreen & Merrick can be credited with the building's overall conception and design. Unfortunately, virtually nothing is known about this firm."
            },
            {
                "SchoolID": 215,
                "Direction": "w",
                "ADA": "1",
                "MagnetDesc": "Classical Academy Magnet",
                "SiteUrl": "classical",
                "Fax": "4129283106",
                "SchoolDescription": "<p>Pittsburgh Classical is a school-wide magnet program. We are located in Pittsburgh&#39;s West End neighborhood. We provide a strong academic core of communications and literary studies, science, social studies, and math. Our curriculum includes an in-depth look at the influence classical societies have had on our modern, western world and how we can continue to use those ideas to help shape our future world. In addition, we emphasize art education, physical education, Spanish language, and instrumental music. We enhance our curriculum by integrating technology through the use of our three computer labs, smart boards, ELMOs, and distance learning. As part of our classical focus, we provide students with several interdisciplinary experiences, some unique art opportunities and a special way to celebrate our learning at the end of each year!</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom, Regional Multiple Disabilities Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "qikk3uee7jgvmcbf089i4qithk@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Pittsburgh-Classical-Middle-School/143106059054148?rf=190333451107637",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7692",
                "SchoolTypeID": "4",
                "AddressLine1": "1463 Chartiers Ave 3rd Floor",
                "AddressLine2": null,
                "SchoolName": "Classical 6-8",
                "Zip": "15220",
                "Phone": "4125293110",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:05AM",
                "EndTime": "3:49PM",
                "dwSchoolID": "215",
                "AverageClassSize": null,
                "DistrictID": "9",
                "Mascot": "Knights",
                "Uniform": "No",
                "SchoolColors": "Red, Blue and Silver",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/ab452cf4b8744388b777aad97f00f63916934758281229411128/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18114&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 14:47:53.000",
                "history": null
            },
            {
                "SchoolID": 275,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with a Classical Academy and Science Technology Engineering Arts and Mathematics Magnet",
                "SiteUrl": "schiller",
                "Fax": "4123234192",
                "SchoolDescription": "<h3>Welcome to Pittsburgh Schiller!&nbsp;</h3>\n\n<p><strong>BACKGROUND AND HISTORY</strong></p>\n\n<p>Pittsburgh Schiller is a STEAM Magnet School serving students in grades six, seven, and eight.&nbsp; The school is located on the north side of the city of Pittsburgh at the foot of Troy and Spring Hill.&nbsp;</p>\n\n<p>Schiller STEAM Academy is named in honor of Frederick Von Schiller, a German poet and philosopher. Architects M. M. Steen, C. L. Wooldridge, and G. P. Ellis designed the school. The school was built in 1941 for a cost just under 500,000 dollars and was originally opened as an elementary school.&nbsp; The physical plant is small with 18 classrooms on two floors.&nbsp;</p>\n\n<p>The Pittsburgh Schiller STEAM Academy magnet provides a rigorous academic program and also involves STEAM- focused curriculum in all classes, as well as a STEAM Lab utilized by all students.</p>\n\n<p><strong>CORE VALUES</strong></p>\n\n<p>The core values of the Schiller school community include the belief that all students can learn to high standards and that rich experiences in the arts and career education are necessary to prepare students for life and work in a diverse and rapidly changing society.</p>\n\n<p>At Schiller, students are expected to be present and on time for school and all classes, to behave respectfully towards all others and to work to the best of their ability at all times.</p>\n\n<p>The motto of the school is &quot;Character is higher than intellect.&quot;</p>\n\n<p><strong>FACULTY AND STAFF</strong></p>\n\n<p>The faculty is a community of learners and is committed to a continual process of self-reflection and improvement of practice.&nbsp; The school implements a series of on-going professional development for staff and encourages all staff members to take advantage of extensive professional development opportunities offered by the district and the Pittsburgh Federation of Teachers.&nbsp;</p>\n\n<p><strong>THE SCHOOL PROGRAM</strong></p>\n\n<p>Pittsburgh Schiller 6-8 STEAM (Science, Technology, Engineering, Arts and Mathematics) Academy is a partial Magnet Program located on Pittsburgh&#39;s North Side. Pittsburgh Schiller&#39;s mission is to educate every child to high standards in a safe, orderly, and caring school environment.&nbsp;</p>\n\n<p>Pittsburgh Schiller uses the PBIS Model, and we incorporate STRONG (Self-Disciplined, Team-Oriented, Respectful, On task, Nice, Growing Daily) into all aspects of our day. Schiller uses a token economy system that allows the students to earn Stallion Cash as a reward for positive behavior, and they have an opportunity to shop at our school store several times per month to earn incentives.</p>\n\n<p>Students are also given an outlet to show their creative and athletic side by participation in stimulating after school activities, clubs, and sports. Pittsburgh Schiller provides students with numerous extracurricular activities, sports, and outstanding community partnerships to enrich student learning. Activities include: Yearbook, African American History Challenge Bowl, Positive Spin, and many more. Schiller students are also afforded the opportunity to showcase their athletic talent in such sports as boys and girls cross country, basketball, soccer and soccer. Many of our students participate in after-school programs at the Sarah Heinz House, which is conveniently located right across the street. Unique partnerships with Big Brothers / Big Sisters, Carnegie Science Center, and Mercy Behavioral Health Services round out Pittsburgh Schiller&#39;s enrichment opportunities for students.</p>\n\n<p><strong>PARENT INVOLVEMENT</strong></p>\n\n<p>The Schiller administration and faculty recognize that effective partnerships with the home and community are key components in maximizing academic success for all students.&nbsp; The faculty and staff are committed to maintaining strong lines of communication with the home to provide parents and guardians with timely information regarding the progress of their children.</p>\n\n<p>A meeting for all parents, guardians, faculty and staff is held at the beginning of the school year to discuss the most recent achievement data, the meaning of performance levels, and instructional priorities.&nbsp; Regular communication is also facilitated by the preparation and distribution of a monthly newsletter and school calendar.</p>\n\n<p>The Schiller Parent School Community Council meets on a monthly basis to review the practices and policies of the school, share information on the school curriculum and program, and plan activities to support the continued achievement of all students in the school.</p>\n\n<p><em>Thank you for visiting our website. Check back for monthly calendar, newsletter, and student spotlight!</em></p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "inrthualuo73roo931ilui98vk@group.calendar.google.com",
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/pages/Schiller-Elementary-School/197827643572850?ref=br_tf",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "379",
                "SchoolTypeID": "4",
                "AddressLine1": "1018 Peralta St",
                "AddressLine2": null,
                "SchoolName": "Schiller 6-8",
                "Zip": "15212",
                "Phone": "4125294190",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "7:35AM",
                "EndTime": "2:17PM",
                "dwSchoolID": "275",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": null,
                "Uniform": "White or Baby Blue - Collared Oxford (button down) or Collared Polo Shirts ONLY. Navy blue pants, walking shorts, skirts, skorts or jumpers.",
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/173b9924a3784d74a25362c8038a1a0c10287630326368799548/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18122&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-07 13:13:52.927",
                "history": null
            },
            {
                "SchoolID": 250,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "southbrook",
                "Fax": "4125728177",
                "SchoolDescription": "<p>Pittsburgh South Brook 6-8 is a neighborhood middle school located in Pittsburgh&#39;s Brookline community that serves the neighborhoods of Brookline, Bon Air, Carrick and Overbrook. A comprehensive middle school program is offered including a 90-minute communications block, a 90-minute mathematics block, science, and social studies. The program is enhanced by classes in art, music, instrumental music, and physical education. An extensive Special Education program is offered including gifted services, full inclusion for learning support students, Read 180, and an Emotional Support classroom. Support services include a Developmental Advisor, a Student Assistance Program, and a partnership with Family Links. We will hold ourselves accountable for preparing all children to achieve academic excellence and strength of character, so they have the opportunity to succeed in all aspects of life. We believe that all children can learn at high levels and teachers have a profound impact on student development. Education begins with a safe and healthy learning environment and families are an essential part of the educational process.</p>\n\n<p>&nbsp;</p>\n\n<p>TITANS INVOLVED IN TAKING ACTION NOW is a program to promote citizenship, academics, attendance, honesty, and responsibility. Students are recognized for following school rules, maintaining good attendance, and achieving academically with Titan Tickets. Students will have the opportunity to win &acirc;&euro;&oelig;rewards&acirc;&euro; every Friday with their Titan Tickets. Rewards can include school spirit items or clothing, special lunch privileges, or gift cards to name just a few!</p>\n\n<p>&nbsp;</p>\n\n<p>Extracurriculars at South Brook include Student Council, newspaper, yearbook, chorus, band, color guard, dance team, majorettes, cheerleading, and National Junior Honor Society. Sports include after-school intramurals and interscholastic sports teams including volleyball, soccer, basketball, cross country, and wrestling. Partnerships include the Society for Contemporary Craft, Manchester Craftsman&#39;s Guild, and Family Links.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "jicm2jo4h24bi6pf0od96r0he0@group.calendar.google.com",
                "StaffWebpageURL": "http://www.pps.k12.pa.us/site/Default.aspx?PageType=1&SiteID=507&ChannelID=692&DirectoryType=6",
                "FacebookURL": "https://www.facebook.com/pages/South-Brook-Middle-School/145475458831269",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7693",
                "SchoolTypeID": "4",
                "AddressLine1": "779 Dunster St",
                "AddressLine2": null,
                "SchoolName": "South Brook 6-8",
                "Zip": "15226",
                "Phone": "4125298170",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:20AM",
                "EndTime": "4:00PM",
                "dwSchoolID": "250",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/a54db2fdf50f49b698198ca6269ff75416807655227692174923/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18123&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:57:45.000",
                "history": null
            },
            {
                "SchoolID": 205,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "southhills",
                "Fax": "4125728148",
                "SchoolDescription": "<p>Pittsburgh South Hills 6-8 is a neighborhood school located in Pittsburgh&#39;s Beechview community. The core curriculum is enhanced by computer education, music, art and physical education. Additionally, South Hills is an English as a Second Language Program regional site. Since the middle school experience is a bridge to high school, students at South Hills Middle School are reminded and encouraged to manage their personal activities in a responsible manner to prepare them for high school and beyond!</p>\n\n<p>&nbsp;</p>\n\n<p>Students may participate in National Junior Honor Society, student council, band and orchestra, after-school tutoring and Homework Club, Dance Team, and Cheerleading. We also offer the following sports: cross country, volleyball, soccer, and baseball, wrestling and swimming.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Emotional Support Classroom, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "c5gei60k2ui6d4lviv0l61idkg@group.calendar.google.com",
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/pittsburghsouthhillsms/?fref=ts",
                "TwitterURL": null,
                "InstagramURL": "https://www.instagram.com/southhillshuskies/",
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "7888",
                "SchoolTypeID": "4",
                "AddressLine1": "595 Crane Ave",
                "AddressLine2": null,
                "SchoolName": "South Hills 6-8",
                "Zip": "15216",
                "Phone": "4125298130",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:51PM",
                "dwSchoolID": "205",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": null,
                "Uniform": null,
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/476d6e3e806148fba5f0f55bd252c245960418708418682111/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18124&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-08 19:21:19.467",
                "history": null
            },
            {
                "SchoolID": 279,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with a Classical Academy Magnet",
                "SiteUrl": "sterrett",
                "Fax": "4122477877",
                "SchoolDescription": "<p>Pittsburgh Sterrett 6-8 is a neighborhood school and partial Classical Academy Magnet school located in Pittsburgh&#39;s Point Breeze community. Students are encouraged to develop and refine skills in reading, writing, speaking, problem-solving and computer use while cultivating an understanding and appreciation for the influence and contribution of various cultures to human history. Accelerated mathematics courses are available, as well as Spanish and German instruction and instrumental music. The curriculum focuses on classical history, incorporating interdisciplinary instructional activities in history with world language, literature, communication skills and the arts. At Sterrett, there is an emphasis on cognitive thinking skills, computer skills, and creative skills as all students are prepared to compete in the 21st century. Moreover, all students are continually challenged to excel by teachers, parents and the community at large working together. This relationship results in fostering a lifelong love of learning and a responsibility for one&#39;s community. With this support, the talents of all students are nurtured and each student is encouraged to develop into socially responsible young adults who give freely of their time and energy for the betterment of our society. Students who live in the Minadeo feeder pattern do not have to apply to the Sterrett Classical Academy Magnet program.</p>\n\n<p>&nbsp;</p>\n\n<p>Students can participate in the PA Jr. Academy of Science, Think-A-Thon, National City Bank Essay Contest, Citizens Bank MLK Essay Contest, Peace On Earth Essay Contest, Math Counts Competition, Readers Make Leaders Club, Science Fair, Zulama, Smallabs, iPads for Blended Learning, Instrumental Programs, NJHS (National Junior Honor Society), Yoga Fitness club, Walking Club, Spanish Club, Ultimate Frisbee Club and Robotics. Also, students may participate in city athletics like basketball, soccer, and softball. Our students contribute to the community through Stash the Trash Community Service, Redd-Up Pittsburgh Community Clean-Up, and community service at various senior citizens centers. We have a jazz ensemble, chess lessons, and chorus. Sterrett maintains a motivational partnership with CMU, PITT, Frick Park, Eye to Eye, the Pittsburgh Penguins and is affiliated with the Mt. Ararat Mentoring Program.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "3005d0hb0nqktrr12k0l7lc26g@group.calendar.google.com",
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/profile.php?id=100007332045819",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "7039",
                "SchoolTypeID": "4",
                "AddressLine1": "7100 Reynolds St",
                "AddressLine2": null,
                "SchoolName": "Sterrett 6-8",
                "Zip": "15208",
                "Phone": "4125297870",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:42PM",
                "dwSchoolID": "279",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": null,
                "Uniform": null,
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/cf56d220de7c48dd9e936bb0c4599d539830598318003470831/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18127&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-04 16:07:26.257",
                "history": "Sterrett School is a Classically inspired school building interesting not only for its turn-of-the-century architectural features, but also for the patronage of its wealthy neighbors. Andrew Carnegie's sons (Will, Andrew, and Frank) attended Sterrett as did Henry Clay Frick's only son and oldest child, Childs Frick. H.C. Frick donated library books, a telescope fabricated by noted atronomer John A. Brashear, and athletic equipment to the school. The library was on of the most complete school libraries in America at the turn of the century. Sterrett is also noteworthy for the fine natural illumination provided by the large windows of its design, for its stained glass (much of which has been removed), and for the uniquely progressive elements it contained: an observatory, an auditorium with full stage, and a drill room in the basement staffed by a special instructor. The second-story auditorium is characteristic of the late nineteeth century; schools designed after 1910 had their auditoriums on the first story for easier public access."
            }
        ],
        "K-5 Schools": [
            {
                "SchoolID": 102,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "A Traditional Academy Magnet",
                "SiteUrl": "alleghenyes",
                "Fax": "4123234109",
                "SchoolDescription": "<p>Pittsburgh Allegheny K-5 emphasizes high academic standards to promote student achievement, character development and community pride in a highly structured and disciplined school environment. The instructional program is designed around the District&#39;s comprehensive curriculum, emphasizing the Pennsylvania learning standards in reading, math, writing, science, social studies, art, music and physical education. Pittsburgh Allegheny K-5 is a whole Magnet Traditional Academy with an emphasis on writing, beginning in kindergarten. Writing skills are embedded across all content areas including related arts. Additional Educational Services: Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": null,
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/ATAElementary?fref=ts",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "7615",
                "SchoolTypeID": "2",
                "AddressLine1": "810 Arch St",
                "AddressLine2": null,
                "SchoolName": "Allegheny K-5",
                "Zip": "15212",
                "Phone": "4125294100",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:10AM",
                "EndTime": "3:44PM",
                "dwSchoolID": "102",
                "AverageClassSize": null,
                "DistrictID": "8",
                "Mascot": "Northstars",
                "Uniform": "Navy blue only pants, shorts, skirts and dresses. White, light blue or navy blue tops.",
                "SchoolColors": "Blue and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/6d3b78829c9c4bb09beb6ed22fb1d60415175275666097265617/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18071&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-07 12:36:15.280",
                "history": "<p>Allegheny School was the first high school in Allegheny City. The 1904 building was built as an annex to the original (now demolished) 1888 building. Both were designed by Frederick J. Osterling (1865-1934), a prominent Pittsburgh architect known for exanding H.H. Richardson&#39;s Allegheny County Jail, among other buildings. In 2000, Landmarks presented an Award of Merit to the Board of Public Education for the sensitive design and installation of a handicapped-accessible entrance to the 1936 Allegheny school building.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>"
            },
            {
                "SchoolID": 108,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "arsenalprek-5",
                "Fax": "4126227310",
                "SchoolDescription": "<p>Pittsburgh Arsenal PreK-5 is a neighborhood school located in Pittsburgh&#39;s Lawrenceville community with a diverse population that provides an academic environment that focuses on developing the whole child. We believe that every child can achieve excellence and it is our goal to provide students with the skills, knowledge, tools, and support they need to excel in life. We emphasize high academic standards to promote student achievement in a highly structured and disciplined school environment. The instructional program is designed around the District&#39;s comprehensive curriculum, emphasizing the Pennsylvania learning standards in reading, math, writing, science, social studies, art, music and physical education. Our school is a Regional English as a Second Language site. One-third of our population consists of students learning the English language. We have 18 countries represented at Arsenal and 14 languages spoken.</p>\n\n<p>&nbsp;</p>\n\n<p>To complement our academic program, Pittsburgh Arsenal Pre K-5 offers activities and programs to enrich the whole child. Our programming includes a community-led after school tutoring program, instrumental music, chorus, culturally responsive art activities and African drumming. All children in 4th and 5th grade learn to play the piano during music classes and there is an intramural sports program after school for 3rd - 5th students. We also build upon the leadership skills of responsible students through opportunities to participate in Student Council and Safety Patrol. We partner with various community organizations to enhance the learning environment including a health and wellness program with UPMC St. Margaret. Additional community partners include Carnegie Library of Pittsburgh, Reading is Fundamental, Lawrenceville United and Strong Women, Strong Girls to provide additional literacy, community, and mentoring opportunities for our students.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "q4nrc69osrm60j0kfbj4mbf3fs@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Arsenal-Elementary-School/169455383082189",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7889",
                "SchoolTypeID": "2",
                "AddressLine1": "215 39th St",
                "AddressLine2": null,
                "SchoolName": "Arsenal PreK-5",
                "Zip": "15201",
                "Phone": "4125297307",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:00AM",
                "EndTime": "2:46PM",
                "dwSchoolID": "108",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": "Building a community of learners.",
                "Uniform": "Light Yellow, Navy Blue or Baby Blue Collared Oxford (button down) OR Collared Polo Shirts ONLY. Navy Blue or Khaki pants, walking shorts, skirts, and/or jumpers no more than 2-inches above the knee (no cargo pants)",
                "SchoolColors": "Blue and Yellow",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/226d537395a749518249ca710b9cbfd518434747404808270440/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18074&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 14:36:51.000",
                "history": null
            },
            {
                "SchoolID": 103,
                "Direction": "w",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "banksville",
                "Fax": "4125717398",
                "SchoolDescription": "<p>Pittsburgh Banksville K-5 is a neighborhood school located in Pittsburgh&#39;s Banksville community. In addition Pittsburgh Banksville serves as one of the District&#39;s regional English as a Second Language sites. At Pittsburgh Banksville, we are learning to read and reading to learn! Pittsburgh Banksville provides a rigorous academic curriculum emphasizing higher level thinking skills and creative problem solving with a focus on respect for the individual, the community and our environment. Our mission at Pittsburgh Banksville K-5 is to work collaboratively with families and community partners in order to provide students with a safe and nurturing learning environment. We work hard to prepare all children to achieve academic excellence and strength of character, so they have the best opportunity to succeed in all aspects of life.</p>\n\n<p>&nbsp;</p>\n\n<p>We offer a wide array of educational experiences based on educational best practices to help every child develop academically, as well as socially and emotionally. All students participate in research projects and other reading initiatives designed to enhance their oral and written communication skills. Both individual and group progress is measured throughout the year in order to ensure students are secure in their skills. In addition, highly qualified staff members specialize in specific content areas to enhance student learning. A school wide behavior management system offers incentives to individual students and classes. A daily morning assembly introduces, models, and reinforces school wide rituals and routines to develop and enhance the positive learning community. A partnership with O.A.S.I.S. tutors further enhances the academic experience through providing student-centered, high-interest learning activities led by retired educational volunteers. In addition each Banksville classroom is equipped with technology centers to further enhance instruction and support students through differentiated instructional activities.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "bd57rfmiv37ervqtggttpr11gs@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Pittsburgh-Banksville-K-5/349791821905",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7501",
                "SchoolTypeID": "2",
                "AddressLine1": "1001 Carnahan Rd",
                "AddressLine2": null,
                "SchoolName": "Banksville K-5",
                "Zip": "15216",
                "Phone": "4125297400",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:30AM",
                "EndTime": "3:04PM",
                "dwSchoolID": "103",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "Bobcat",
                "Uniform": "No",
                "SchoolColors": "Red and Black",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/5f4a4487fdbb4420bd113ccf4ca5008d13541301791958364902/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18076&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 14:37:08.000",
                "history": null
            },
            {
                "SchoolID": 105,
                "Direction": "s",
                "ADA": "0",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "beechwood",
                "Fax": "4125717393",
                "SchoolDescription": "<p>Pittsburgh Beechwood PreK-5 is a neighborhood school located in Pittsburgh&#39;s Beechview community. Pittsburgh Beechwood&#39;s strong academic curriculum emphasizes attainment of standards and early success especially in literacy, mathematics and science. Beechwood is a regional English as a Second Language site. We also house two regional Life Skills classrooms. Our Instructional Focus is &quot;We ROAR (Reading Often Achieves Results) for Reading.&quot; Monthly ROAR assemblies celebrate our enthusiasm for reading with performances by our own ROAR cheerleaders, songs and dramatics. An annual Artist in Residency program through Pittsburgh Center for the Arts has transformed our school into a student art museum reflecting the different cultures of our school as well as features of our community. Each May the projects culminate in a community and school celebration, Nationality Night. Over 600 families and friends attend this annual event to enjoy student musical performances and visit the displays created by Beechwood students.</p>\n\n<p>&nbsp;</p>\n\n<p>Some of the student&#39;s activities include: Art club, Chess Club, Civic Light Opera School Program, Pittsburgh Public Theater Creative Dramatics, Drama Club, Lego Club, After School Sports, Instrumental Music, Concerts, Garden Club, Safety Patrol, SECTUM Energy Patrol, Basketball, Track, Writer&#39;s Club, ROAR Cheerleaders, and School Store. Partnerships include Pittsburgh Center for the Arts, Pittsburgh History and Landmarks, Familylinks, and Community Leaders United for Beechview (CLUB).</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "t9rg1bru9vniojrn0nbfkpmj60@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/PghBeechwoodElem/?fref=ts",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6019",
                "SchoolTypeID": "2",
                "AddressLine1": "810 Rockland Ave",
                "AddressLine2": null,
                "SchoolName": "Beechwood PreK-5",
                "Zip": "15216",
                "Phone": "4125297390",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:45PM",
                "dwSchoolID": "105",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "Lion",
                "Uniform": "No",
                "SchoolColors": "Blue and Yellow",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/f6e05fc0ab9d4b498a41e9f1cb084b9112597118704156624291/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18077&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 14:42:33.000",
                "history": null
            },
            {
                "SchoolID": 118,
                "Direction": "s",
                "ADA": "0",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "concord",
                "Fax": "4128857758",
                "SchoolDescription": "<p>Pittsburgh Concord K-5 is a neighborhood school located in Pittsburgh&#39;s Carrick community. Pittsburgh Concord K-5 is student-focused, well managed, and innovative. A professional, dedicated and caring staff, an active group of involved parents, and students who are inquisitive and have a hunger for knowledge generously support Pittsburgh Concord. All of these stakeholders combine to sustain a rich academic environment. We will hold ourselves accountable for preparing all children to achieve academic excellence and strength of character, so that they have the opportunity to succeed in all aspects of life. The Pittsburgh Concord motto is: &quot;Watch our Comets Soar.&quot; Our instructional focus is: &quot;All Pittsburgh Concord students, through a coordinated whole-school effort, will show measurable growth in Reading Comprehension across all subjects and genres as demonstrated by data from Classroom Diagnostic Test (CDT), DIBELS, and PSSA.&quot;</p>\n\n<p>&nbsp;</p>\n\n<p>To complement its strong academic programs, Pittsburgh Concord K-5 offers a full range of intramural sports that reflect the diversity of the students&#39; backgrounds and interests, including track and field, boys and girls basketball, and swimming. Current community partnerships include the Civic Light Opera, in which students use the arts to enhance academic achievement. Also, members of Oasis Intergenerational tutor students weekly in grades K-3. Pittsburgh Concord is a member of the Student District University Collaborative and has several student teachers from various local universities.&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "6b0kbhfr6lps3abbkah8j8lvmg@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "330",
                "SchoolTypeID": "2",
                "AddressLine1": "2350 Brownsville Rd",
                "AddressLine2": null,
                "SchoolName": "Concord K-5",
                "Zip": "15210",
                "Phone": "4125297755",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:42PM",
                "dwSchoolID": "118",
                "AverageClassSize": null,
                "DistrictID": "7",
                "Mascot": "Comets",
                "Uniform": "No",
                "SchoolColors": "Royal Blue and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/f6e8579fecde4c8d991ab2bfd168fcf95937970250716433868/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18084&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:34:29.000",
                "history": "Concord School, built in 1939, leans toward the traditional side of Steen's work: a kind of Neo-Georgian simply executed in red brick with Moderne curves and geometric metalwork. Concord School is an essay in excellent proportion with the grouped fenestration characteristic of a school as its principal means. Somehow this wonderful building was omitted from the National Register nomination process."
            },
            {
                "SchoolID": 161,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "A Traditional Academy for the Arts and Humanities Magnet",
                "SiteUrl": "dilworth",
                "Fax": "4126655012",
                "SchoolDescription": "<p>Pittsburgh Dilworth PreK-5 is a traditional Magnet school with an emphasis on arts integration and humanities for all subject areas. We believe that all children can learn, and education begins with a safe and healthy learning environment. Our very active parents and highly trained and dedicated staff help to make the students&#39; achievement dreams come true through partnering and communication. It is our goal to help students understand how our world and lives are interconnected through their academic, arts, and humanities experiences. Our students are also able to learn another language in our after-school language program; languages offered include French, Spanish, and Chinese.</p>\n\n<p>&nbsp;</p>\n\n<p>As a school family, we strive to make our students Promise-Ready. Pittsburgh Dilworth is a highly structured and disciplined setting for students who are most comfortable and successful in such a learning environment. PreK-5 parents and students sign a contract with the academy, ensuring that children will comply with strict regulations for conduct, attendance, homework, and appropriate dress.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "gg3o08de3pvlgf247mot7f8nug@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Dilworth-Elementary-School/184908151530784?rf=254967671209281",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6024",
                "SchoolTypeID": "2",
                "AddressLine1": "6200 Stanton Ave",
                "AddressLine2": null,
                "SchoolName": "Dilworth PreK-5",
                "Zip": "15206",
                "Phone": "4125295000",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:15AM",
                "EndTime": "3:45PM",
                "dwSchoolID": "161",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": "Panther",
                "Uniform": "Navy blue pants, shorts, skirts and dresses. Navy blue or white tops.",
                "SchoolColors": "Black and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/418dcb7f60904c81875007788507d5958349403292711780746/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18086&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:24:33.000",
                "history": "Dilworth School was designed three years after the 1911 decision to consolidate the city school boards of Pittsburgh and Allegheny City. Until 1935 the school district contracted with independent architectural firms for school designs. Dilworth School was conciously elegant, stylistically unique in the city, and echoed European school designs of the 1910s. It also incorporated progressive educational features such as a well-lit Kindergarten. By this time, the basement play spaces had become an essential part of the schools buildings, and they commanded much design attention. The school reveals progressive trends in school design to be found in Chicago and St. Louis, particularly in regard to detailing. Dilworth School's architects, Martin U. Vrydaugh and Thomas B. Wolfe, were partnered c. 1892. The school is named for Mary Dilworth, who originally owned a large tract of land in the area."
            },
            {
                "SchoolID": 142,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "faison",
                "Fax": "4122470105",
                "SchoolDescription": "<p>Pittsburgh Faison is a comprehensive K-5 school. We pride ourselves in using a learner-centered arts-integrated model where students can use multiple intelligences to become better learners and citizens prepared to achieve success in all of their endeavors. Faison enjoys partnerships with families, community partners as well as civic leaders and organization. These stakeholders clearly understand that the current and future success of the Homewood and East Hills communities is connected to our investment in our youth.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "hkou0egj8p6bmifi0e430abjpk@group.calendar.google.com",
                "StaffWebpageURL": null,
                "FacebookURL": null,
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": "https://groups.google.com/forum/#!topic/pps-open-forum/19pudhkC_SM",
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": "https://lp.constantcontact.com/su/Z5Z0hfX",
                "StarSchool": "1",
                "StateID": "8204",
                "SchoolTypeID": "2",
                "AddressLine1": "7430 Tioga St",
                "AddressLine2": null,
                "SchoolName": "Faison K-5",
                "Zip": "15208",
                "Phone": "4125292305",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:56PM",
                "dwSchoolID": "142",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": "Lion",
                "Uniform": "Khaki or navy blue pants, shorts, skirts and dresses. Navy blue or white tops.",
                "SchoolColors": "Purple and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/3d26f2098a874aa2b4dc6ae306793c2a17939587359936480562/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=121116&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-09-16 15:25:36.370",
                "history": null
            },
            {
                "SchoolID": 134,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with a French Emphasis Magnet",
                "SiteUrl": "fulton",
                "Fax": "4126654969",
                "SchoolDescription": "<p>Pittsburgh Fulton PreK-5 is a neighborhood school located in Highland Park. The instructional program is based on the District&#39;s comprehensive curriculum. Fulton offers a unique blending of a structured, traditional neighborhood setting with a French-emphasis Magnet program that promotes the study of French culture and the study of French in various countries of the world.</p>\n\n<p>&nbsp;</p>\n\n<p>French is taught in grades K-5 at Pittsburgh Fulton. All children in K-1 get an exposure to the French language-through movement, songs, poetry, basic vocabulary and simple greetings. A distinction is made in the educational programming for Magnet and non-Magnet students starting in grade 2. Students who have officially enrolled in the French Magnet program receive direct classroom instruction. Basic French vocabulary is taught and expanded into sight words, sentences and simple paragraphs. Emphasis is on developing oral and auditory language skills (speaking and listening). Children are asked to respond to what they hear in French, follow commands (movement in the classroom), answer questions, or identify vocabulary. French writing assignments are based on classroom teaching and learning. Those students in the Magnet program have the opportunity to continue in the International Baccalaureate Magnet program at Pittsburgh Obama 6-12.</p>\n\n<p>&nbsp;</p>\n\n<p>At Fulton, our goal is to stretch our students&#39; minds through higher level and critical thinking skills. Identified K-5 gifted and talented students receive enrichment during morning group (HOSTS) time with the gifted and talented teacher. This period is used to develop and extend those skills, and it includes: cross grade level grouping, creative and challenging activities, independent projects, scholarly talk, and competitions through the Allegheny Intermediate Unit. We also encourage these students to participate in our pre-algebra club.</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Fulton PreK-5 has numerous opportunities for students to participate in extra-curricular activities. Students in 4th and 5th grade may participate in basketball and track. In addition, we have instrumental music for grades 4-5 and chorus for K-5. Students also interact in different service projects such as planting flowers and visiting the Highland Park Senior Care Center. Students also benefit from our relationship with the nearby Pittsburgh Zoo and PPG Aquarium through observing and exploring animal behaviors first-hand. Fulton partners with Indiana University of Pennsylvania&#39;s teacher candidate program providing student teachers who help to reduce the student to teacher ratio in our classrooms. Another benefit of the partnership with IUP is the opportunity for our 4th and 5th grade students to visit the campus, tour classrooms, meet professors and students, and in general, learn about college life. This unique opportunity serves to enhance the desire to have all of our students be PROMISE READY. Family Links provides on-going educational topics, addressing bullying, drugs and alcohol, decision-making, self-esteem and how to form relationships. One on one counseling is also provided to students and families on an as-needed basis. East End Cooperative Ministries provides after-school homework help and activities Monday through Thursday throughout the academic year.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "juk3unp5flr06l3d9h5k3v31qc@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Pittsburgh-Fulton-PTO-PSCC/259290414121320",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/ppsfultonpto/",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6026",
                "SchoolTypeID": "2",
                "AddressLine1": "5799 Hampton St",
                "AddressLine2": null,
                "SchoolName": "Fulton PreK-5",
                "Zip": "15206",
                "Phone": "4125294600",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:45PM",
                "dwSchoolID": "134",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": "",
                "Uniform": "Khaki or navy blue pants, shorts, skirts and dresses. Red, white, blue or yellow tops. ",
                "SchoolColors": "Red and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/3debc98d915645c1b8be6855e51298e011723198659722995483/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18090&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-12-10 11:41:05.000",
                "history": null
            },
            {
                "SchoolID": 136,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "grandview",
                "Fax": "4124886846",
                "SchoolDescription": "<p>Pittsburgh Grandview K-5 is a comprehensive neighborhood school which serves the communities of Allentown, Beltzhoover and Knoxville. Pittsburgh Grandview provides a rigorous academic program with emphasis on literary and math skills. Our school wide focus is that all students will grow in their ability to read, reflect and respond to print. The art and music teachers also support our school wide focus by integrating academics in their subject area.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "4k37rltbcn4u57er75hun84nis@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/GrandviewSchool",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "400",
                "SchoolTypeID": "2",
                "AddressLine1": "845 Mclain St",
                "AddressLine2": null,
                "SchoolName": "Grandview PreK-5",
                "Zip": "15210",
                "Phone": "4125296605",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:00AM",
                "EndTime": "2:40PM",
                "dwSchoolID": "136",
                "AverageClassSize": null,
                "DistrictID": "8",
                "Mascot": "Wildcat",
                "Uniform": "No",
                "SchoolColors": "Blue and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/04f5e5a23631442aa03a50435196815b6720929508321290706/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18091&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:35:49.000",
                "history": null
            },
            {
                "SchoolID": 147,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "A Spanish Emphasis Magnet",
                "SiteUrl": "liberty",
                "Fax": "4126228499",
                "SchoolDescription": "<p>Pittsburgh Liberty K-5 is located in the heart of Shadyside and is a school-wide Magnet program with an emphasis in Spanish. If learning a foreign language is important to you, Pittsburgh Liberty K-5 is the right place! Beginning in kindergarten and continuing through grade 5, teachers routinely use Spanish throughout the day. In addition, students receive direct instruction in the language. Students also learn about the culture of many Spanish speaking countries throughout the year. Classrooms adopt&nbsp;a country for a semester, learning about its geography, history, and culture. As a culminating activity, students, teachers and staff share their knowledge and expertise with each other and their families.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "icer6tge5e5qj20otn4crnibkg@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/LibertyPPS/",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://pghleaf.org/",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "http://www.pps.k12.pa.us/cms/module/selectsurvey/TakeSurvey.aspx?SurveyID=170",
                "StarSchool": "0",
                "StateID": "6042",
                "SchoolTypeID": "2",
                "AddressLine1": "601 Filbert St",
                "AddressLine2": null,
                "SchoolName": "Liberty K-5",
                "Zip": "15232",
                "Phone": "4125298450",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:21AM",
                "EndTime": "3:56PM",
                "dwSchoolID": "147",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": "Eagle",
                "Uniform": "Khaki or navy blue pants, shorts, skirts and dresses. Tops should be collared tops of any color, no neon colors. ",
                "SchoolColors": "Navy Blue and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/3d7fca164a7f416b934743df82d8f9f03411210483266630055/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18096&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-03-29 08:20:48.000",
                "history": null
            },
            {
                "SchoolID": 148,
                "Direction": "e",
                "ADA": "0",
                "MagnetDesc": "Technology and Pre-Engineering Academy",
                "SiteUrl": "lincoln",
                "Fax": "4126654959",
                "SchoolDescription": "<p>Pittsburgh Lincoln PreK-5 is a neighborhood school with a technology emphasis. Emphasis is on providing a well-rounded education through experiential learning. Lincoln&#39;s goals are: to increase the number of students who pursue engineering technology programs; provide equitable and inclusive opportunities for all academically qualified students; and provide clear standards and expectations for students success in all subjects.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "5mdga1954rjeclr1vr0fkdhbp0@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/PghLincolnSTEAM",
                "TwitterURL": "",
                "InstagramURL": "https://www.instagram.com/pghlincolnsteam",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "1",
                "StateID": "7870",
                "SchoolTypeID": "2",
                "AddressLine1": "328 Lincoln Ave",
                "AddressLine2": null,
                "SchoolName": "Lincoln PreK-5",
                "Zip": "15206",
                "Phone": "4125293980",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:05AM",
                "EndTime": "2:51PM",
                "dwSchoolID": "148",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": "Lion",
                "Uniform": "Khaki or navy blue pants, shorts, skirts and dresses. Yellow, white or blue tops.",
                "SchoolColors": "Blue and Yellow",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/4a4a451992094010b5eed22ec94c163e418604593822495168/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18097&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:37:11.000",
                "history": "Lincoln School is one of Pittsburgh's first two Art Deco school buildings. Lincoln, in the Lincoln-Larimer neighborhood, shares the honor with Prospect School on Mt. Washington design by M.M. Steen; both were built in 1931. Lincoln School was designed by Thomas Pringle and Oliver J. Robling. These architects had designed an addition to Linden School (on the National Register) in 1927 and an addistion to madison School in 1929; Lincoln School appears to be their only new school design. A handsome building of contrasting shades of bugg brick, Lincoln School's facade displays \"dog-tooth\" piers (brickwork laid so that rows of troamgular edges point outward) with stepped or \"Mayan\" tops, chevron panels under the windows, and a stylized owl set within a sunburst over the main entrance. The plan - gymnasium on one side of the classroom block and auditorium on the other - is important. This plan, found for perhaps the first time in M.M. Steen's 1924 Oliver High School, would become the norm for most Pittsburgh school buildings, with the auditorium often serving as a nieghborhood meeting place. Lincoln's auditorium is lower than the gymnasium and juts out farther; later schools usually have symmetrical wings. The 1930s character of the auditorium appears to be intact. While the room has some handsome touches (marble wainscoting, Classical-Moderne pilasters on either side of the stage, and geometric metal ventilating grilles) it is not as innovative a space as is the contemporaneous 1931 Prospect School auditorium, which the National Register normations form called \"one of Pittsburgh's most fully realized Art Deco interiors.\""
            },
            {
                "SchoolID": 149,
                "Direction": "e",
                "ADA": "0",
                "MagnetDesc": "A German & Chinese Mandarin Emphasis Magnet",
                "SiteUrl": "linden",
                "Fax": "4126652035",
                "SchoolDescription": "<p>Are you looking to provide your child with the opportunity to discover new worlds, connect with other cultures, and learn a second language? If so, we have the program for you! Pittsburgh Linden K-5 is a whole school language elementary Magnet located in the neighborhood of Point Breeze. We provide a kindergarten to fifth grade program where students receive language and culture exposure in either Mandarin Chinese or German. All incoming&nbsp;kindergarten students&nbsp;will be enrolled in the Mandarin Chinese language program.&nbsp;Students&nbsp;will learn to speak, read, and write German or Chinese from our certified and bilingual foreign language teachers and experience the infusion of the two cultures and languages through daily activities, interdisciplinary activities, and celebrations including Oktoberfest and Chinese New Year. Those students in the German and Mandarin Magnet program have the opportunity to continue in the International Baccalaureate Magnet Program at Pittsburgh Obama 6-12 in 6th grade. The motto of Pittsburgh Linden K-5 is to Be Respectful, Be Responsible and Be Safe, which help students to develop self-control, character, orderliness, safety, and efficiency.</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Linden K-5 offers a variety of extracurricular activities to students. These activities include: Safety Patrol, Chorus K-5, Instrumental Music, School-Wide Community Service Projects, Intramurals, Team Sports (Swimming, Basketball, Track and Field), Chess Club, Book Battles, After-School Reading and Mathematics Tutoring Program for students in grades 3-5, German and Mandarin Celebrations, DARE, The Children&#39;s Program Before and After-School Program, Pittsburgh Center for the Arts Artist in Residency Program, and the Western Pennsylvania Conservancy and After-School Clubs (Art Club, Odyssey of the Minds, Girls on the Run and Strong Women Strong Girls).</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "52hq69j7v883l14amlv0gr42eg@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/PghLindenPTA",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6044",
                "SchoolTypeID": "2",
                "AddressLine1": "725 S Linden Ave",
                "AddressLine2": null,
                "SchoolName": "Linden K-5",
                "Zip": "15208",
                "Phone": "4125293996",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:10AM",
                "EndTime": "3:41PM",
                "dwSchoolID": "149",
                "AverageClassSize": null,
                "DistrictID": "4",
                "Mascot": "Lion",
                "Uniform": "No",
                "SchoolColors": "Red and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/03be2ab0d8dd4673917e9dd8086267ec15411636534826405478/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18098&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:37:29.000",
                "history": null
            },
            {
                "SchoolID": 154,
                "Direction": "c",
                "ADA": "1",
                "MagnetDesc": "An African-Centered Academy",
                "SiteUrl": "miller",
                "Fax": "4123383834",
                "SchoolDescription": "<p>Pittsburgh Miller PreK-5, located in Pittsburgh&#39;s Hill District, is an African-Centered Academy, teaching and promoting the history and culture of people of African descent and the principles of Nguzo Saba. Pittsburgh Miller PreK-5 creates a culture of excellence through high expectations and accountability for all stakeholders where failure is not an option. Our student-centered approach to education is designed to provide every child with a gratifying yet rigorous school experience, every day, every period, from bell to bell. We provide a quality comprehensive education in which teachers believe all children can learn. We use both traditional and innovative teaching and learning methods to draw from each child his or her unique gifts of knowledge and understanding. Our teaching staff is engaging in a study of Human Centered Design to become equipped with creative and innovative teaching methods to enhance the school experience. We are deliberate and intentional in ensuring that our students of color feel connected to their culture and heritage. Our vision is to create the type of learning environment that empowers students through a sense of cultural location and self-worth. Every child at Pittsburgh Miller PreK-5 receives a value-based education utilizing an Afrocentric approach that will prepare him or her to be thinkers who are competent, confident contributors to our society.</p>\n\n<p>&nbsp;</p>\n\n<p>At Miller African Centered Academy, we are striving towards excellence in student performance in academics, behavior, and community. Our goal is to ensure that we add value to every student in reading, mathematics, writing and science as indicated by local and state standardized assessments. We pledge to do this work, by examining racial equity to become non-racist educators who provide academically challenging teaching and learning environments for all children. Educators at Pittsburgh Miller are consistently involved in developing professionally; gaining the skill set needed to develop the Whole Child. It is our goal to ensure that all of our students are able to demonstrate personal responsibility and respect for self and others in school as well as within their community. As a result, we teach and provide opportunities for students to practice the seven Nguzo Saba Principles each day, which help them develop character, personal responsibility and self-awareness. We also offer a wide range of student activities including the Miller &acirc;&euro;&oelig;Drummers and Dancers&acirc;&euro; Kids of Steel-Health and Wellness initiative, Basketball Team, Creative Writing Club, Strong Women Strong Girls, PBIS, Creative Dramatics, DREAMTEAM-Student Council and 5th grade Dancing Classrooms.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "vj5nprvb46rsvv87seppkllu54@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/PghMiller",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "https://player.vimeo.com/video/183772299",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "8108",
                "SchoolTypeID": "2",
                "AddressLine1": "2055 Bedford Ave",
                "AddressLine2": null,
                "SchoolName": "Miller PreK-5",
                "Zip": "15219",
                "Phone": "4125293830",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:15AM",
                "EndTime": "2:41PM",
                "dwSchoolID": "154",
                "AverageClassSize": null,
                "DistrictID": "3",
                "Mascot": "Sankofa",
                "Uniform": "Khaki or navy blue pants, shorts, skirts and dresses. Red, white, yellow, blue tops. ",
                "SchoolColors": "Black, Green, Yellow and Red",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/355bb53f0a95432aa50658b8e8770808808952757615620370/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18103&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-08-06 12:09:47.000",
                "history": null
            },
            {
                "SchoolID": 155,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "minadeo",
                "Fax": "4124224889",
                "SchoolDescription": "<p>Pittsburgh Minadeo is a PreK-5 neighborhood school&nbsp;nestled&nbsp;on a quiet residential street in Squirrel Hill. The school was named in memory of John Minadeo, a patrol boy at the former Gladstone School located on Hazelwood Avenue, who gave his life to help save others from a runaway car.&nbsp; To support our safe learning environment the Student Code Conduct is followed and supported by a strong School Wide Positive Behavior Intervention Program and supports. Behavior Expectations are communicated through a framework called PRIDE: Polite, Responsible, In- Control, Do Your Best, and Engaged. It is a proactive, positive, instructional approach to classroom management. We hold ourselves accountable for preparing all children to achieve academic excellence and strength of character, so they have the opportunity to succeed in all aspects of life.</p>\n\n<p>There are several technology programs, a computer lab, and iPads that provide another media for student learning.&nbsp; All students in grades K-5 are scheduled for physical education art, and music. Students visit the library weekly for book circulation. The choral and instrumental music students prepare annual winter and spring concerts.&nbsp; Students can also join the ukulele club or choose to learn African drumming.&nbsp; In grade 3, each student is exposed to 9 new instruments.&nbsp; This is a great opportunity to decide if he or she would like to join instrumental in 4th or 5th grade.</p>\n\n<p>There are many programs at Minadeo that support academic achievement as well as development of the whole child.</p>\n\n<p>Our students can also participate an annual talent show, join the boys and girls basketball teams, and train for the Pittsburgh Kids Marathon. Minadeo has partnerships with community organizations such as Center of Life, The Pittsburgh Chess Club, Squirrel Hill Urban Coalition, Oasis Tutors, Reading to The Dogs, and many local universities to provide additional opportunities for meeting the needs of a diverse student population.&nbsp; We partner with MEDP to provide before school care and after school care until 6:00 PM.</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Emotional Support, Occupation Therapy and Physical Therapy, 2 Regional Life Skills Support Classrooms, Regional Emotional Skills Support Classroom, 2 Regional, Autistic Support Classrooms, Reading Intervention, and Enrichment.</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "kmm95bbcef1p209ttpj6gdr9lk@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://facebook.com/JohnMinadeoElementary/",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/pages/Minadeo-PTO/165555950199767",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "363",
                "SchoolTypeID": "2",
                "AddressLine1": "6502 Lilac St",
                "AddressLine2": null,
                "SchoolName": "Minadeo PreK-5",
                "Zip": "15217",
                "Phone": "4125294035",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:46PM",
                "dwSchoolID": "155",
                "AverageClassSize": null,
                "DistrictID": "5",
                "Mascot": "Mustang",
                "Uniform": "No",
                "SchoolColors": "Red and Blue",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/480fe40289624f79a2e2d1c380e12fc314942131823629755406/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18104&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-02-05 08:27:25.000",
                "history": null
            },
            {
                "SchoolID": 141,
                "Direction": "e",
                "ADA": "0",
                "MagnetDesc": "Montessori Magnet",
                "SiteUrl": "montessori",
                "Fax": "4126652038",
                "SchoolDescription": "<p>Pittsburgh Montessori School PreK-5 is a public Montessori Magnet School that serves children of 36 months in age through early adolescence. The school is located in the heart of Pittsburgh&#39;s Friendship community, a diverse and vibrant neighborhood. The campus has a terrific play park, a fenced and paved play area, beautiful shade trees, a peace garden and an edible garden! The historic and majestic 110-year-old building is a new location for Pittsburgh Montessori. While the School District of Pittsburgh has offered a Montessori program since 1980, the location of the school has changed several times.</p>\n\n<p>&nbsp;</p>\n\n<p>Our vision at Pittsburgh Montessori is to perpetuate the Montessori philosophy in a peaceful learning environment. The uniqueness of each student will guide our teachers in nurturing the child&#39;s curiosity as well as implementing meaningful and creative instructional methods to educate the whole child. Throughout the years, our belief in and dedication to the philosophy has remained steadfast. We believe that through our work with children, there is much that we can do individually and collectively to bring humanity to a deeper understanding, a higher well being, and a greater spirituality. Each year, we thoughtfully rededicate our community to the service of the child, Montessori ideals, and the belief that education is the strongest armament of peace. The faculty, staff, students, parents and community of Pittsburgh Montessori School embrace the Montessori method to educate our children. Our mission is to respect each child by providing a peaceful environment that fosters self-directed learning, encourages creative thinking, and cultivates a love for lifelong learning.</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Montessori offers many extracurricular activities, including upper school basketball teams and track, as well as after school tutoring. During the school day, community building activities such as lower school Student Advisory, upper school Student Council, award-winning Think-A-Thon, Garden Club, Knitting Club, Chess Club, and wilderness experience at Linsley Outdoors School. Before and after school care is available. Our active community partnerships include: Arbor Day with Pittsburgh Friends of the Urban Forest, Stash the Trash, in-school movement classes with Dance Alloy, diversity workshops with the Intercultural House, peace education with American Friends Service Committee, summer play dates at the play park with Friendship Preservation Group, and our Edible School Yard program with Grow Pittsburgh.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "22844ajfsm3m8o8130nrrbjlug@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pghmontessoriptsc/",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/pghmontessoriptsc/",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "351",
                "SchoolTypeID": "2",
                "AddressLine1": "201 S. Graham Street",
                "AddressLine2": null,
                "SchoolName": "Montessori PreK-5",
                "Zip": "15206",
                "Phone": "4125292010",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:10AM",
                "EndTime": "3:51PM",
                "dwSchoolID": "141",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/c9171d558d4b474885eb1cad7c22db7e1263540517530417837/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18116&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:42:29.000",
                "history": null
            },
            {
                "SchoolID": 168,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with a Spanish Emphasis Magnet",
                "SiteUrl": "phillips",
                "Fax": "4124884200",
                "SchoolDescription": "<p>Pittsburgh Phillips K-5 is located in the heart of Pittsburgh&#39;s South Side neighborhood. Strong parental support, a talented and committed team of teachers, and positive school climate serve as the foundation of a thriving school community. Pittsburgh Phillips K-5 is a Spanish Emphasis Magnet School. As a partial magnet, we enroll neighborhood students and also accept students from across the city of Pittsburgh through the annual magnet lottery. All students at Pittsburgh Phillips receive direct Spanish language instruction throughout the week that extends and enriches the core curriculum. Students also benefit from incidental and daily contact with the Spanish language. Seven of our staff members are certified or proficient in Spanish. All students at Pittsburgh Phillips receive music, art, and gym. 4th and 5th grade students may take instrumental music. Students also have the opportunity to participate in a variety of after school programs. All students at Pittsburgh Phillips benefit from resources granted for reading and math instruction through the federally funded Title I program.</p>\n\n<p>&nbsp;</p>\n\n<p>Our staff not only sets high expectations for all students by delivering differentiated instruction, but also embraces the 5Ps (Present, Prompt, Prepared, Polite, and Productive) as a philosophy that teaches social responsibility and character development. Students earn weekly Phantom and Rainbow Awards in addition to the monthly Phillips Surprise that recognizes students for consistently following the 5Ps. Pittsburgh Phillips K-5 is a caring, inclusive environment where strong communication among staff and administration provides a scaffolding to ensure success for all students and teachers.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "i1lo7bpsoat8v25an2cbdensak@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Phillips-Elementary-School/139348092770357",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/pages/Pittsburgh-Phillips-K-5-PTO/148831061818963",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "395",
                "SchoolTypeID": "2",
                "AddressLine1": "1901 Sarah St",
                "AddressLine2": null,
                "SchoolName": "Phillips K-5",
                "Zip": "15203",
                "Phone": "4125295190",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:44PM",
                "dwSchoolID": "168",
                "AverageClassSize": null,
                "DistrictID": "7",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/8ce57e1f80cd4e989e29498228fa62fa10510612130724059799/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18112&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:54:29.000",
                "history": null
            },
            {
                "SchoolID": 172,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "roosevelt",
                "Fax": "4128857784",
                "SchoolDescription": "<p>Pittsburgh Roosevelt PreK-5 is a neighborhood school located in Pittsburgh&#39;s Carrick community. At Pittsburgh Roosevelt, the focus is &quot;Excellence for All.&quot; The instructional program is designed around the District&#39;s comprehensive curriculum, emphasizing the Pennsylvania learning standards in reading, math, science, social studies, art, music, and physical education. The Instructional Focus of the school is reading comprehension across all content areas. We are committed that all students will learn each day and in every classroom. The expectation at Pittsburgh Roosevelt is that all students can achieve. School policies, practices and curriculum are designed to sustain the academic rigor of the school and to ensure that all students are contributing members of the school community. Pittsburgh Roosevelt is a model of an exemplary school program that offers best practices and supports all students, regardless of ability, with the highest quality instruction and support in the least restrictive educational environment. At Pittsburgh Roosevelt PreK-5, students are encouraged to be a Roosevelt B.E.A.R.; students will always be safe, encourage others, demonstrate accountability for their own actions and words, and show respect.</p>\n\n<p>&nbsp;</p>\n\n<p>At Pittsburgh Roosevelt, we offer two after school programs for students in grades one-five. The Elect Student Works Program provides academic and recreational activities Monday through Thursday, 3 hours per day, following school dismissal. This program is provided FREE to all eligible children. At Pittsburgh Roosevelt, we offer an extended day YMCA Program on site. It begins immediately at dismissal and runs until 6PM daily, Monday-Friday. This is a state licensed after-school program. Additionally, we participate in the Think-A-Thon; Stash the Trash Days, and the SECTUM contest each year.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "6bj4a1qgrc26b6nvm8tlqum3ug@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Roosevelt-Elementary-School/169104276439831",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/rooseveltpto2",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7742",
                "SchoolTypeID": "2",
                "AddressLine1": "17 W Cherryhill St",
                "AddressLine2": null,
                "SchoolName": "Roosevelt PreK-5",
                "Zip": "15210",
                "Phone": "4125297788",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:30AM",
                "EndTime": "3:01PM",
                "dwSchoolID": "172",
                "AverageClassSize": null,
                "DistrictID": "7",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/39b4bcd13ae5496bbf99318cd0d12fc56532301549770087815/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18119&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:55:33.000",
                "history": null
            },
            {
                "SchoolID": 178,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "springhill",
                "Fax": "4123233008",
                "SchoolDescription": "<p>Pittsburgh Spring Hill K-5 is a neighborhood school located in Pittsburgh&#39;s Spring Hill community. Pittsburgh Spring Hill K-5 is the home of COMP MAN! and COMP DOG! The school hosts a VIP Ribbon Program that recognizes excellence in academics, citizenship, attendance, and behavior. We have school-wide behavioral &quot;Shining Star&quot; monthly awards, &quot;I Read to the Principal&quot; and &quot;the Principal Says I&#39;m a Math Wizard&quot; programs, and the Caught Being Good program. Title I services are provided to all students.</p>\n\n<p>&nbsp;</p>\n\n<p>Spring Hill also has Friday Clubs for chorus, intramural sports, 24 Challenge Math Game, our gardening project and the school newsletter. We have partnerships with ESB Bank, Sarah Heinz House, Pittsburgh Ballet Theatre, Opera Connections, Spring Hill Civic Association; Reading is Fundamental Program, Carnegie Library&#39;s BLAST Program, Mercy Behavioral Health, D.A.R.E., Big Brothers &amp; Big Sisters, Discover Books, Strong Women Strong Girls, CitiParks, and The Western Pennsylvania Conservancy.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": null,
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/pages/Spring-Hill-Elementry-School/224948507556154?rf=158661797500892",
                "TwitterURL": "https://twitter.com/SpringHillK5?lang=en",
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "7362",
                "SchoolTypeID": "2",
                "AddressLine1": "1351 Damas St",
                "AddressLine2": null,
                "SchoolName": "Spring Hill K-5",
                "Zip": "15212",
                "Phone": "4125293000",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:05AM",
                "EndTime": "2:49PM",
                "dwSchoolID": "178",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": null,
                "Uniform": null,
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/6cd2acaa7f764bddb09e026145c615187745528321294319556/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18126&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-04 17:58:13.017",
                "history": null
            },
            {
                "SchoolID": 184,
                "Direction": "c",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "weil",
                "Fax": "4123383848",
                "SchoolDescription": "<p>Pittsburgh Weil PreK-5 is a school on the move! Pittsburgh Weil PreK-5 is a neighborhood school located in Pittsburgh&#39;s Hill District. Pittsburgh Weil provides standards-based and data-driven instruction, and learning is designed to meet students&#39; individual needs. We offer a safe and welcoming atmosphere where respect and kindness flourish. Our small size provides a great environment where every child and family is known by name. Your child will receive the individual attention he/she deserves from a committed and energetic staff. In addition, our Pittsburgh Weil families receive support from our many community partnerships.</p>\n\n<p>&nbsp;</p>\n\n<p>At Weil, specific rituals and routines are followed throughout the school day. Academic safety nets, including: a 30 minute Reading Intervention period, Wilson Reading Program, as well as an on-site after school program, are offered for students who need additional support. We emphasize developing good study skills and habits. In addition to a strong core academic program, students at Weil have many opportunities to participate in extracurricular programs, enrichment activities, sports, and a variety of school sponsored events and assemblies. Some of the activities our students have participated in include Everybody Wins Book Club, instrumental music, D.A.R.E., Dancing Classrooms, Carnegie Library BLAST, after-school tutoring, and team sports like basketball. student achievement.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "rui9f7claplcab10k5v6s2ntj0@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/A-Weil-Elementary-School/122995971081185",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7876",
                "SchoolTypeID": "2",
                "AddressLine1": "2250 Centre Ave",
                "AddressLine2": null,
                "SchoolName": "Weil PreK-5",
                "Zip": "15219",
                "Phone": "4125293840",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:00AM",
                "EndTime": "3:50PM",
                "dwSchoolID": "184",
                "AverageClassSize": null,
                "DistrictID": "3",
                "Mascot": "",
                "Uniform": "Collared shirt either white, yellow, or blue but any color is permissible-any bottoms and shoes.",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/3bdbbdbfad8f4a2b833b7a8b4e098a455138776630568652572/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18133&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 16:08:47.000",
                "history": null
            },
            {
                "SchoolID": 185,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "westliberty",
                "Fax": "4125717424",
                "SchoolDescription": "<p>Welcome to Pittsburgh West Liberty PreK-5. Pittsburgh West Liberty Elementary is a PreK-5 neighborhood school located in Pittsburgh&#39;s Brookline neighborhood. Our vision is to provide an environment where each child is able to develop academically, emotionally, and socially to his/her fullest potential. We are a comprehensive elementary school, with two classes of each grade level, one autistic support classroom, and two learning support classes. &quot;Where Learners Excel and Character Counts&quot; is West Liberty&#39;s motto. Pittsburgh West Liberty PreK-5 is the place where we are all learners - students, staff, and parents - working together toward excellence. Pittsburgh West Liberty PreK-5 has a dedicated and experienced staff, strong Parent School Community Council, a hardworking Parent/Teacher Organization, and engaged parents to help us to excel. Our students are respectful and hard working. Pittsburgh West Liberty PreK-5 is a place where your learners will excel!</p>\n\n<p>&nbsp;</p>\n\n<p>To complement our strong academic programs, Pittsburgh West Liberty PreK-5 offers a growing range of extra-curricular activities such as: SECTEM, Carson Scholarship, the Annual Science Fair, Strong Women Strong Girls, Safety Patrol, Girls and Boys Basketball Teams, Musical Concerts &amp; Performances, Peer Tutors, All-District Track Meets, Girls on the Run, Mad Science Program, and Ballroom Dancing Classrooms. Also we have Comprehensive Counseling Services, First in Math, Eagles Soar Past 24, Monthly Writing Assignments, Principal Book of the Month and Bullying Prevention Programs. In addition to the extra-curricular activities, Pittsburgh West Liberty PreK-5 has partnerships with KPMG, Family Links, Oasis Tutoring, Glen Hazel Nursing Home and the Carnegie Library - Brookline Branch to provide additional opportunities to our students.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "j7k195bdbom3bg32abuo4kblp4@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/West-Liberty-Elementary-School/106192336105351",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/pages/West-Liberty-Parents/150335061381",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7694",
                "SchoolTypeID": "2",
                "AddressLine1": "785 Dunster Ave",
                "AddressLine2": null,
                "SchoolName": "West Liberty PreK-5",
                "Zip": "15226",
                "Phone": "4125297420",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:45PM",
                "dwSchoolID": "185",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/4df97469b8ae4085bf58559593737f7217918923025675095081/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18134&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-28 08:03:31.000",
                "history": null
            },
            {
                "SchoolID": 186,
                "Direction": "w",
                "ADA": "0",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "westwood",
                "Fax": "4129286577",
                "SchoolDescription": "<p>We welcome all students and parents to Pittsburgh Westwood K-5. At Pittsburgh Westwood, we stress academic achievement, appropriate behavior, and caring for others.&nbsp; Strong emphasis is placed on attaining and surpassing the benchmarks in Literacy and Mathematics.</p>\n\n<p>&nbsp;</p>\n\n<p>We have a school wide uniform policy, electronics policy, and behavior plan.&nbsp; We are proud of our DARE Program and our school calendar, which is bursting with activities for students, parents, and staff.&nbsp; We are committed to promoting a community of learners!</p>\n\n<p>&nbsp;</p>\n\n<p>Our staff is dedicated to providing every child with the opportunity to grow academically and emotionally through enriched activities and programs geared to promote thinking and learning. We encourage parent participation in all phases of our school day as tutors, classroom volunteers, readers, etc. Our existing PSCC and PTO members invite new members to join them in planning programs and activities for the new school year!</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Westwood K-5 is committed to producing students who will be able to set achievable goals and compete with the brightest and best in our society. Together we can make all the difference for our children!</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "kar09896vu1dchaahl8pvhd1h0@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7877",
                "SchoolTypeID": "2",
                "AddressLine1": "508 Shadyhill Rd",
                "AddressLine2": null,
                "SchoolName": "Westwood K-5",
                "Zip": "15205",
                "Phone": "4125296570",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:12AM",
                "EndTime": "2:51PM",
                "dwSchoolID": "186",
                "AverageClassSize": null,
                "DistrictID": "9",
                "Mascot": "",
                "Uniform": "White, Baby Blue, Navy Blue, or Black collared shirts. Khaki, tan, navy blue or black walking shorts, pants, skirts, skorts or jumpers.",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/1128f3f910fa4520b1db3fa7285b97131410175945798442177/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18136&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-28 08:21:50.000",
                "history": null
            },
            {
                "SchoolID": 187,
                "Direction": "s",
                "ADA": "0",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "whittier",
                "Fax": "4124884255",
                "SchoolDescription": "<p>Pittsburgh Whittier K-5 is a neighborhood school located in Pittsburgh&#39;s Mt. Washington community, guided by the motto &quot;High Expectations - High Achievement - High Atop Mt. Washington.&quot;</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Whittier is committed to achieving academic excellence and building strength of character within a warm, nurturing learning environment where ALL students can learn, achieve, and grow. Technology supports include iPad carts and a computer lab.</p>\n\n<p>&nbsp;</p>\n\n<p>A school-wide achievement recognition program called &quot;Great Performances!&quot; provides monthly incentives to students who demonstrate an increase in academic performance. This program is supported by the Parent School Communicty Council.</p>\n\n<p>&nbsp;</p>\n\n<p>Whittier is supported by the PTO, PSCC, Mt. Washington communicty Lion&#39;s Club, LeMont Restaurant, Educational Partnership, Carnegie Library, Reading is Fundamental, OASIS Tutors. Studnets participate in Carson Scholarship Essay Contest, Jackie Robinson Art and Writing Contest, RiverQuest, ALCOSAN, Career Day, Challenge 24.</p>\n\n<p>&nbsp;</p>\n\n<p>Programs and activities include School Spirit Days, Student Council, D.A.R.E., Strong Women, Stron Girls, Cub Scouts, Chess Club, Art Club, Boys and Girls Intramurals, POWER UP.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, K-2 Regional Autistic Support Classroom, Include Me from the Start, Occupation Therapy and Physical Therapy, Mercy Behavioral Health</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "0e6bbdv2k5d2co7rktpa5k1c80@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Whittier-Elementary-School/127189627327529",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "1",
                "StateID": "7885",
                "SchoolTypeID": "2",
                "AddressLine1": "150 Meridan St",
                "AddressLine2": null,
                "SchoolName": "Whittier K-5",
                "Zip": "15211",
                "Phone": "4125298211",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:05AM",
                "EndTime": "2:45PM",
                "dwSchoolID": "187",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/19af977b144949339dfa56a8739087f47887092433710804217/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18137&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-28 08:22:09.000",
                "history": null
            },
            {
                "SchoolID": 189,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with Science Technology Engineering Arts and Mathematics Magnet",
                "SiteUrl": "woolslair",
                "Fax": "4126238810",
                "SchoolDescription": "<p>Pittsburgh Woolslair Pre K-5 is a hidden gem nestled among the streets of Bloomfield and Lawrenceville and housed in a Nationally Historic Landmark Building. Starting in the 2015-2016 school year, Woolslair became&nbsp;a partial STEAM (Science, Technology, Engineering, Arts and Math) magnet in grades K-2 as well as a neighborhood school. The school&#39;s partial magnet program&nbsp;grew one grade at a time after the 2015-2016 school year encompassing all grades in the 2018-2019 school year. At its core, STEAM education combines several disciplines into project based&nbsp;learning to help students gain a better understanding of how science, technology, engineering, the arts, and mathematics relate in the real world. Additionally, this program&#39;s unique approach promotes hands-on learning, ownership, and collaboration to help all types of learners succeed. Woolslair&#39;s STEAM program is available by application for students who reside in any area of the city. Non-magnet students will also receive STEAM education programming while at Woolslair.</p>\n\n<p>&nbsp;</p>\n\n<p>At Pittsburgh Woolslair, our students participate in our 3Rs School-Wide Positive Behavior Plan. Each student is expected to follow the 3Rs throughout the school day - Respectful, Responsible, and Ready and Safe. Students are rewarded monthly for following the 3Rs. Woolslair offers&nbsp;an Energy Committee (grades 3-5), Student Envoys (grades 3-5), and a Safety Committee (grades 4-5). We have partnerships with Bloomfield Garfield Corporation, St. Margaret Health Partnership, Mercy Behavioral Health, and Bloomfield Preservation Society. Students have frequently won the Ben Carson Scholarship.</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "m37htc0f5fqpf7ii25age7i2ck@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Woolslair-Elementary-School/148258075199321",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "1",
                "StateID": "7502",
                "SchoolTypeID": "2",
                "AddressLine1": "501 - 40th St",
                "AddressLine2": null,
                "SchoolName": "Woolslair PreK-5",
                "Zip": "15224",
                "Phone": "4125298800",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:51PM",
                "dwSchoolID": "189",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": "",
                "Uniform": "Students are permitted to wear ONLY plain solid navy blue or khaki (tan) jumpers, skirts, slacks, trousers or walking shorts.  Plain solid white, yellow, light blue or dark blue blouses or shirts with collars or turtlenecks are required. ",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/c50d481edf9b41298a440dd446f007a18511252404097459270/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18138&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-06-19 11:57:00.000",
                "history": "Woolslair School is a warm golden brick building in a Romanesque-style modified by Classical details: oval oculus and Palladian windows and Renaissance balconies are placed over Romanesque-arched entrances or at the center of rows of Romanesque-arched windows. Woolslair resembles Samuel T. McClarren's other Pittsburgh school commission, the National Register John Morrow School in Brighton Heights, and both buildings evoke the design vocabulary of Longfellow, Alden & Harlow. Samuel Thornburg McClarren's (b. 1862) primary known contributions to regional architecture include two Pittsburgh publice schools, several churches, and the Husler Building in Carnegie, now the Historical Society of Carnegie, PA.'"
            }
        ],
        "K-8 Schools": [
            {
                "SchoolID": 101,
                "Direction": "s",
                "ADA": "0",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "arlington",
                "Fax": "4124884709",
                "SchoolDescription": "<p>Pittsburgh Arlington is a neighborhood school located in Pittsburgh&#39;s Arlington community. The school is located at 800 Rectenwald Street. The staff models specific skill sets, including work ethic and professionalism, oral and written communication skills, teamwork and collaboration, problem-solving and critical thinking skills. Students are encouraged to excel through incentives and recognition for citizenship, honor roll, Attendance Awards and READ 25. Pittsburgh Arlington PreK-8 faculty, staff, students, parents and community are committed to creating an atmosphere that respects the abilities and needs of all students. Our goal is to develop the foundation to enhance and ensure their success in school and later in society.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Pittsburgh Arlington PreK-8&#39;s 2015-2016 Plan to Improve Outcomes for Students:</strong></p>\n\n<p>During the 2015-2016 school year, our school will implement the following interventions to increase student achievement:</p>\n\n<ul>\n\t<li>Continued implementation of Response to Intervention and Instruction (RtII) - this is a comprehensive multi-tiered, standards aligned strategy to enable early identification and intervention for students at academic or behavioral risk;</li>\n\t<li>An Early Literacy Specialist will focus on supporting grades K-2 in the areas of curriculum implementation, delivering professional development, collecting and analyzing data, supporting RtII and providing direct student intervention;</li>\n\t<li>The counselor will focus on helping students improve their behavior, increase their attendance and reduce suspensions;</li>\n\t<li>Every morning, every student in the building participates in a literacy intervention program based on their individual needs. The program is focused on improving phonic skills, reading fluency and reading comprehension skills;</li>\n\t<li>Three days per week teachers participate in literacy and math content meetings where they have the opportunity to lesson plan together, analyze student data, discuss and address any concerns as a team as well as have grade level team meetings to discuss reading and writing across the curriculum;</li>\n\t<li>Continuation of the School Assistance Program (SAP), which is a partnership between the school and community providers to address student behavioral needs by school-based programming in prevention, early intervention and support;</li>\n\t<li>The opportunity for all students to participate in the Summer Dreamer&#39;s Academy; and</li>\n\t<li>The opportunity for basic and below basic students to participate in a 4 week Saturday Program that will begin near the end of February 2016.</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Emotional Support Classroom, Regional Autistic Support Classroom</p>\n",
                "SchoolAlertBox": "<p><em><strong>Please note the <a href=\"http://www.pps.k12.pa.us/Page/4653\">School Dress Code</a> at Pittsburgh Arlington PreK-8</strong></em></p>\n",
                "GoogleCalendarID": "jobnignpk0gnf7e04uuemeqgk4@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/arlingtoneagles",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7878",
                "SchoolTypeID": "3",
                "AddressLine1": "800 Rectenwald St",
                "AddressLine2": null,
                "SchoolName": "Arlington PreK-8",
                "Zip": "15210",
                "Phone": "4125294700",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:45PM",
                "dwSchoolID": "101",
                "AverageClassSize": null,
                "DistrictID": "7",
                "Mascot": "Eagle",
                "Uniform": "Khaki, black, navy or gray pants, skirts or shirts. White, blue (light and navy), black, yellow, and pink collared polo shirts or collared button-up shirts.",
                "SchoolColors": "Black and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/e51e1122145a4955a0d68a3ca9b0dd7d1872077715275776502/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18073&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 14:33:13.000",
                "history": null
            },
            {
                "SchoolID": 110,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "brookline",
                "Fax": "4125717386",
                "SchoolDescription": "<p>Pittsburgh Brookline PreK-8 is a neighborhood school over 100 years old, with deep historical roots within the Brookline Community. Many current parents and grandparents attended the school, and continue to support its educational efforts as important stakeholders in our goal of Promise Readiness for every child. Grades K-5 are housed in the main building while the middle grades are located in air-conditioned demountable classrooms on the campus just behind the main building. Middle level students travel into the main building to attend Visual Arts, General Music, Health/ Physical Education, Instrumental Music, and Chorus classes. All students have access to the arts. The rigorous learning environment is enhanced by a positive school-wide behavior plan based upon recognition for contributing to a positive school culture: Compliment Cards and DREAM cards. Reward ceremonies include Student of the Month, Compliment card Compliment card and DREAM card incentives, 25 Book Incentives, and quarterly ceremonies for Honor Roll, High Honor Roll, Perfect Attendance, and Citizenship. Students who achieve all three in a report period receive The Principal&#39;s Award.</p>\n\n<p>&nbsp;</p>\n\n<p>Instruction begins with 30 minutes of Intervention or Enrichment classes that are differentiated to support each child&#39;s learning goals based upon individual data. Students attend classes for eight periods each day over a six day schedule-Day 1, 2, 3, 4, 5, 6, with one period for lunch and recess. Breakfast and lunch are provided in the cafeteria on the ground floor; students have access to a large grassy field, a basketball court and a kick ball court for outside recess, weather permitting. The core curriculum subjects include Reading or Communications, Math, Science, and Social Studies. Algebra is offered at the eighth grade level to recommended students who are proficient in 7th grade math. Reading Intervention classes include Read 180, Wilson, and Language for Learners. Three regional Autistic Support classrooms provide an inclusive teaching and learning environment with a focus on the core curriculum. Learning Support teachers act as a resource to other teachers and provide core curriculum supports based upon individual student data.</p>\n\n<p>&nbsp;</p>\n\n<p>Technology is widely used to support instruction&acirc;&euro;&rdquo;each classroom has student computers; all students in grades 5-8 have a writing lab and a math lab once a week. Two computer labs are accessible to all students, and two wireless laptop and iPad carts are accessible to the upper grades.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "2u84dof0hfm9q3361oqluois84@group.calendar.google.com",
                "StaffWebpageURL": "http://www.pps.k12.pa.us/site/Default.aspx?PageType=1&SiteID=461&ChannelID=480&DirectoryType=6",
                "FacebookURL": "https://www.facebook.com/PghBrooklinePrek8/?fref=ts​",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": null,
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "7868",
                "SchoolTypeID": "3",
                "AddressLine1": "500 Woodbourne Ave",
                "AddressLine2": null,
                "SchoolName": "Brookline PreK-8",
                "Zip": "15226",
                "Phone": "4125297380",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:48PM",
                "dwSchoolID": "110",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "Brookline Bobcats",
                "Uniform": "No",
                "SchoolColors": "Black and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/8be99bd480a1425b8086db9e1b031db416157803171565506991/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18079&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-04 18:07:48.970",
                "history": null
            },
            {
                "SchoolID": 112,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "A Science and Technology Academy Magnet",
                "SiteUrl": "carmalt",
                "Fax": "4128857764",
                "SchoolDescription": "<p>Pittsburgh Carmalt is a uniform whole school Magnet located in Pittsburgh&#39;s Brookline neighborhood that specializes in Science and Technology with an emphasis on writing and communications. Technology and science are infused through cross curriculum planning for all students. Science and technology are integrated throughout the school day to prepare students for our ever-changing world. Technology instruction begins with kindergartners and progresses through eighth grade. Certified science teachers teach all science classes. Carmalt utilizes two well-equipped computer classrooms, Web-based learning programs and the Microsoft Office Suite. Carmalt has mobile laptop labs that travel to classrooms for student use in all content areas. Learning is enhanced with the use of Smart Boards, Elmos, school pads, response key programs and video conferencing. We also have a school-wide emphasis in writing. All students submit monthly writing pieces following the PA Common Core. We participate in research based writing studies. We additionally have writing experiences outside of the classroom. Students present and defend their own selected writing pieces at the end of the school year. Grades 6-8 present to the community and grades k-5 present at the annual Take Your Loved One to School Day. Students participate in community wide writing projects. The faculty, staff, students, parents and community of Pittsburgh Carmalt PreK-8 is committed to building pride in academic excellence.</p>\n\n<p>&nbsp;</p>\n\n<p>Structured caring is the key to Carmalt&#39;s student success. We strive to provide a place where all children can learn when expectations are set to the highest level and commitment to high student achievement is uncompromising. Honesty, integrity, truthfulness and respect are valued as vital components of personal growth for everyone. Character development is emphasized each day, along with goal setting. Pittsburgh Carmalt&#39;s high expectations and goals for the entire school community are communicated and supported in order to sustain the vision of every student becoming a lifelong learner and a responsible citizen in this century. Pittsburgh Carmalt offers educational opportunities for all students to embrace cultural diversity in a structured environment. Carmalt offers soccer, softball, cross country and basketball boys and girls sport teams, intramurals for students in grades 4-8, and a variety of after-school clubs including technology and tutoring. Students participate in many activities including Chorus, student council, and Think-A-Thon. Students engage in many competitions such as Westinghouse Energy for the Future Contest, Pennsylvania Junior Academy of Science, Future Sim City Competition, Kids Creating Community Contest, the Citizen Bank Essay contest and African American History Bowl. Additionally, over 200 distance-learning experiences allow students to learn virtually anywhere.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "9u89jop99rgkbo3psg1oaf2mm4@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "http://www.facebook.com/PPSCarmalt",
                "TwitterURL": "https://twitter.com/@PPSCarmalt",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/groups/762820707135961/?ref=br_tf ",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "326",
                "SchoolTypeID": "3",
                "AddressLine1": "1550 Breining St",
                "AddressLine2": null,
                "SchoolName": "Carmalt PreK-8",
                "Zip": "15226",
                "Phone": "4125297760",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "9:05AM",
                "EndTime": "3:45PM",
                "dwSchoolID": "112",
                "AverageClassSize": null,
                "DistrictID": "6",
                "Mascot": "Carmalt Dragons",
                "Uniform": "Solid black, navy blue or khaki dress pants, capris, skirts or skorts. Solid white, light blue, navy, black, yellow, khaki or gold collared shirts.",
                "SchoolColors": "Black and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/ab3fc6f784ca42ad894854e8911d01f65414362152731265463/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18080&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 14:46:45.000",
                "history": null
            },
            {
                "SchoolID": 116,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "colfax",
                "Fax": "4124224896",
                "SchoolDescription": "<p>Pittsburgh Colfax K-8 is a neighborhood school nestled in the heart of the Squirrel Hill community. Colfax serves students living in parts of Squirrel Hill, East Hills, Homewood, Shadyside, and Point Breeze. In addition to a comprehensive academic core program, students have access to gifted education at the Pittsburgh Gifted Center. Our school offers Spanish language courses and English as a Second Language teachers to meet the needs of English Language Learners. Other offerings include Learning Support, Speech and Language itinerant services, Instructional Support, Occupational Therapy, Physical Therapy and interscholastic athletics. Our students also have access to a school swimming pool that is utilized in grades 3-8 within their physical education classes. We are committed to providing an opportunity for all children to learn within a safe, caring atmosphere designed to nurture the spirit and stimulate the intellect. With our total commitment to children, we feel we are succeeding in our mission to provide an enriching educational experience preparing our students to achieve academic excellence and strength of character, so they have the opportunity to succeed in all aspects of life.</p>\n\n<p>&nbsp;</p>\n\n<p>Activities at Colfax K-8 are tailored by grade level and include Chess Club, Challenge 24 Club, Think-A-Thon, Chorus, yearbook, student council, Sectum Energy Team, Reading and Math tutoring, First in Math, Merit Scholars, fourth and fifth grade basketball and swimming, Girls on the Run, cheerleading, Tech-Girls, Guys-Read, Student Newspaper, Middle School Interscholastic Sports include boys and girls soccer, basketball, swimming, and cross country. Colfax has partnerships with the Jewish Community Center, CMU Science Squad, Pittsburgh Chess Club, Grow Pittsburgh, Frick Environmental Center, Frick Art and History Museum, Allderdice, Oasis Intergenerational Tutoring, University of Pittsburgh, and UPMC.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "ah6q1r9t715ri5un9hccj32btc@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Colfax-Elementary-School/149351345118700?rf=146031348754239",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "http://www.colfaxpto.org/",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6022",
                "SchoolTypeID": "3",
                "AddressLine1": "2332 Beechwood Blvd",
                "AddressLine2": null,
                "SchoolName": "Colfax K-8",
                "Zip": "15217",
                "Phone": "4125293525",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:07AM",
                "EndTime": "2:46PM",
                "dwSchoolID": "116",
                "AverageClassSize": null,
                "DistrictID": "4",
                "Mascot": "Cobra",
                "Uniform": "No",
                "SchoolColors": "Black and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/0b77c9cda9fa48d4973114235b4c4dc53429556432944005596/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18083&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:34:14.000",
                "history": "<p>Colfax School is prominently sited on a terrace above a curve in Beechwood Boulevard. Its Jacobean Revival styling and its green yard behind an iron fence are in keeping with the spacious and architecturally eclectic&nbsp;residential neighborhood which is was built to serve. This is Pittsburgh&#39;s only elementary school designed by architect Edward Stotz (1868-1949). Stotz also designed three landmark high schools: Fifth Avenue, South Side, and Schenley. Architecturally, Colfax School plays a transitional role between Stotz&#39;s early compact and traditional school designs and the sleekly sprawling and progressive Schenley High School. The Jacobean Revival styling is typical of the era, and the banded windowns show a new emphasis on light and air. Colfax School was named for Schuyler Colfax, Vice President of the United States under Ulysses S. Grant.</p>\n"
            },
            {
                "SchoolID": 137,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "greenfield",
                "Fax": "4124224879",
                "SchoolDescription": "<p>Pittsburgh Greenfield is a PreK-8 neighborhood school drawing students from six surrounding communities that are located in Pittsburgh&#39;s Greenfield community. Greenfield has a diverse student population that helps make it a very culturally balanced school. We are also proud to say that we have met adequate yearly progress over the past eight years on our PSSA exams. Our goal at Greenfield is to prepare students for The Pittsburgh Promise beginning in kindergarten. We have a strong belief that ALL students can learn and achieve. This is supported through a very active PTO and parents who are committed to their child&#39;s education and future.</p>\n\n<p>&nbsp;</p>\n\n<p>Besides academics, Greenfield offers competitive sports programs. We offer Boys Baseball, Girls Softball, Boys and Girls Swimming, Basketball and Soccer. We also work closely with Mercy Behavioral, WPIC, Family Links and the Hazelwood YMCA. Students can also participate in the ELECT Program and EAP Program.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "j34i8b483iav29hqp0dcn3qlf8@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Greenfield-Elementary-School/158400764208938?rf=133256823384517",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "http://www.greenfieldk8pto.org/",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "6028",
                "SchoolTypeID": "3",
                "AddressLine1": "1 Alger St",
                "AddressLine2": null,
                "SchoolName": "Greenfield PreK-8",
                "Zip": "15207",
                "Phone": "4125293535",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:53PM",
                "dwSchoolID": "137",
                "AverageClassSize": null,
                "DistrictID": "5",
                "Mascot": "Gator",
                "Uniform": "No",
                "SchoolColors": "Green",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/dceba82918b845d6b1b7cece657bbaa63737918660559966111/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18092&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:36:08.000",
                "history": "Greenfield School exemplifies the School Board's desire in the post-World War I era for more sophisticated elementary-school favilities, and reveals the influence of artist and building superintendent James Bonar on the quality of design of the Pittsburgh schools of the 1920s. Plans for this building were prepared in 1916. Construction began in 1922 and the building opened in 1923. German-born and educated Richard Kiehnel (1877-1944) and his partner John Blair Elliott (b. 1868) were commissioned to design the school. Greenfield School, like most of Kiehnel & Elliott's Pittsburgh buildings, is a highly accomplished work of the early twentieth century that drew from contemporary European and American designers such as Joze Plecnik and Frank Lloyd Wright. The National Register nomination form states that Greenfield is one of Pittsburgh's \"most architecturally significant schools, comparable only to Mifflin School for the progressiveness of its design.\" The form further notes that \"the interior of the entrance lobby, with its geometric and foliated capitals, is the highlight of the design.\" The lobby loggia was bricked up in the summer of 1999, an incomprehensible act of vandalism that illustrates both the importance and the limitations of City Historic Structure designation."
            },
            {
                "SchoolID": 195,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "king",
                "Fax": "4123234165",
                "SchoolDescription": "<p>Pittsburgh King PreK-8 is a neighborhood school located in Pittsburgh&#39;s North Side community. We believe that at the heart of the transformation of Pittsburgh King is a shared commitment to and relentless pursuit of racial equity. In order to achieve racial equity, we must create a culture of high expectations for all, and work together to ensure exposure to high quality instruction for every student, in every classroom, every day. Through this transformation, we will ensure 100% of our students enter high school promise ready. As a Title I school, Pittsburgh King benefits from additional resources that support our students in the areas of reading and math. The teachers and students at Pittsburgh King also have access to computer labs, mobile labs, digital visual projectors and a distance-learning lab to enhance the learning experience of all students.</p>\n\n<p>&nbsp;</p>\n\n<p>The motto for our students is &acirc;&euro;&oelig;Learn More, Do More and Become More&acirc;&euro; and it is through this motto that we strive to create a culture of high expectations where all students are encouraged to strive for excellence both academically and behaviorally. The students will take part in a daily Group Guided Instruction (GGI) under the direction of a Pittsburgh King Pre K-8 staff member. GGI is a structured safe environment, facilitated by students under the supervision of a trained staff member. This is an opportunity for explicit instruction of social skills in a group setting. In additional to GGI, all students attend Community Time each day, a time where information is shared with staff and students, promoting critical thinking skills, and team building exercises.</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh King participates in the District&#39;s interscholastic sports programs for both girls and boys. The current sports offered are cross-country, basketball, soccer, baseball and softball. Beginning with Books&#39; &acirc;&euro;&oelig;Everybody Wins&acirc;&euro; program has community members that come to read with our third grade students during lunch. Point Park&#39;s Champions of Character program offers our students college mentors that meet with them throughout the year. Pittsburgh King also has partnerships with the Salvation Army and Mercy Behavioral Health.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "u2785hnskqp9iv43478su8su6k@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7880",
                "SchoolTypeID": "3",
                "AddressLine1": "50 Montgomery Place",
                "AddressLine2": null,
                "SchoolName": "King PreK-8",
                "Zip": "15212",
                "Phone": "4125294160",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:00AM",
                "EndTime": "2:51PM",
                "dwSchoolID": "195",
                "AverageClassSize": null,
                "DistrictID": "8",
                "Mascot": "Monarchs",
                "Uniform": "Maroon (not red), black white or grey collared polo shirts (no logos or graffiti). Khaki or black pants, skirts, skorts or cargo shorts. ",
                "SchoolColors": "Maroon and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/a6a44dd6b7ea4247b3445674c257661012784098583011776654/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18094&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:36:24.000",
                "history": null
            },
            {
                "SchoolID": 140,
                "Direction": "w",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "langley",
                "Fax": "4127782106",
                "SchoolDescription": "<p>Pittsburgh Langley K-8 will be a school where we seek to have students shine through their academics, personal talents and character. Our goal is to nurture students to their fullest potential so that they may become positive contributing members to their families, their local communities and the global community at large. We will also strive to provide a safe, effective school, driven by research, data and standards with a focus on instruction and student engagement.</p>\n\n<p><em><strong>Our Vision</strong> is to foster a community of life-long learners through a respectful and nurturing environment.</em></p>\n\n<p><em><strong>Our Mission </strong>is to provide a safe and supportive environment where students are able to acquire skills contributing to both educational and social-emotional success.</em></p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Autistic Support Classroom, Regional Hearing Impaired Support Classroom</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "s0ep09ajqso12hrri0r8sa5ku8@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Langley-K-8/402578286500567?rf=423134817788404",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "8255",
                "SchoolTypeID": "3",
                "AddressLine1": "2940 Sheraden Blvd",
                "AddressLine2": null,
                "SchoolName": "Langley K-8",
                "Zip": "15204",
                "Phone": "4125292100",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:52PM",
                "dwSchoolID": "140",
                "AverageClassSize": null,
                "DistrictID": "9",
                "Mascot": "",
                "Uniform": "No",
                "SchoolColors": "Red and White",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/506f139c23444a5cbdae6ea0df15c1424988979150208780523/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18095&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:36:38.000",
                "history": "Langley School represents Pittsburgh's great era of high school construction in the 1920s, combining the progressive educational charteristics of Schenley High School with traditional styling. The school was designed by MacClure & Spahr. Langley is MacClure & Spahr's only Pittsburgh public school commission. The design was supposedly modeled after England's Warwick Castle, although the resemblance is limited. In keeping with Langley's early scientific emphasis, the school was named for Samuel P. Langley, aviation pioneer and director of Pittsburgh's Allegheny Observatory."
            },
            {
                "SchoolID": 151,
                "Direction": "n",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "manchester",
                "Fax": "4123233015",
                "SchoolDescription": "<p>Pittsburgh Manchester PreK-8 is a comprehensive neighborhood school located in and drawing on the North Side communities. Numerous cultural assets populate the North Side; many within walking distance are utilized through partnerships to enhance the education of our students. It is the schools mission to provide engaging student-centered instruction that yields proficient and advanced children. We believe that all children are capable of succeeding in school given the appropriate instructional program and support. The foundation of the Pittsburgh Manchester School is to provide a safe effective school, driven by research, data and standards with a focus on instruction, student engagement, an emphasis on evidence, high expectations, parental involvement, ongoing monitoring, recognition of student progress, and strong, visible instructional leadership.</p>\n\n<p>&nbsp;</p>\n\n<p>Our program is enriched by a variety of strategies aimed at supporting the development of basic and advanced skills both during the school day and through after school activities. A thoughtfully designed mentoring program enhances the interactions between older and younger students so that all students benefit and grow from the relationships. In addition to the mentoring program, elementary students have the opportunity to participate in the In-School Scouting program. For the older students, an active student council provides students with a voice in activities. Additionally, Pittsburgh Manchester offers a variety of interscholastic and intramural sports including basketball, soccer, and a new cross country team. Current partnerships include a mentoring program focused on reading through Church Union, a garden renovation project with Sam&#39;s Club, a toy drive, and programs through The United Way and The United Methodist Church to ensure that our students and families are supported in all aspects. Family and community engagement is a priority with active volunteers that enhance the learning environment through their talents and dedication.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Emotional Skills Support Classroom, Regional Autistic Support Classroom, Regional Multiple Disabilities Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "3mvdna081hrfmooesi6l3579co@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Manchester-Elementary/158766964186943",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7871",
                "SchoolTypeID": "3",
                "AddressLine1": "1612 Manhattan St",
                "AddressLine2": null,
                "SchoolName": "Manchester PreK-8",
                "Zip": "15233",
                "Phone": "4125293100",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:00AM",
                "EndTime": "2:45PM",
                "dwSchoolID": "151",
                "AverageClassSize": null,
                "DistrictID": "8",
                "Mascot": "Tiger",
                "Uniform": "No",
                "SchoolColors": "Purple and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/b1edbf053172426dbc4f4e4c7cf816981630137999722438051/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18099&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:37:46.000",
                "history": null
            },
            {
                "SchoolID": 153,
                "Direction": "s",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "mifflin",
                "Fax": "4124644355",
                "SchoolDescription": "<p>Pittsburgh Mifflin PreK-8 is a neighborhood school located in the Lincoln Place community of Pittsburgh. Children from Pittsburgh&#39;s 31st Ward (Lincoln Place, Gates Manor, Hays, New Homestead and Hazelwood neighborhoods) make up the student body. Mifflin teachers utilize the district-adopted curriculums in all academic areas. Our strong academic focus is complimented with related arts classes in music, art, physical education and computer-based programming to support reading, writing and math initiatives. Mifflin is the proud recipient of a school performance profile of 71.2% score. This score is meeting the standard that the State expects for schools in Pennsylvania. In addition to our strong academic focus, Mifflin staff is committed to providing a safe and nurturing environment where all children feel secure and motivated to achieve. Our goal is for a Mifflin student to leave us prepared for a 2 or 4-year college or workforce certification.</p>\n\n<p>&nbsp;</p>\n\n<p>Mifflin PreK-8 implements a school-wide behavior program called Mifflin PRIDE. This program focuses on the core values of Promise-Ready, Integrity, Determination, and Effort (PRIDE). Students who exhibit these values through their actions are rewarded in a variety of ways.</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Mifflin offers many opportunities for student involvement outside of the regular classroom setting. We offer academic support, athletics, musical enrichment and social activities throughout the year. Athletic opportunities also occur at various grade levels. Intramural sports are offered after school for grades four and five. District sponsored interscholastic middle school sports are also available for eligible students. Mifflin offers instrumental music and chorus for students in grades three through eight. Student performances are held several times a year. Mifflin also has a Safety Patrol. Middle school students can also attend holiday dances, ski club trips and an overnight camp experience at the end of the school year. School sponsored field trips also occur throughout the school year at various grade levels.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "ego36cu8cribbe11pug4t1u174@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "7881",
                "SchoolTypeID": "3",
                "AddressLine1": "1290 Mifflin Rd",
                "AddressLine2": null,
                "SchoolName": "Mifflin PreK-8",
                "Zip": "15207",
                "Phone": "4125294350",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "9:10AM",
                "EndTime": "3:45PM",
                "dwSchoolID": "153",
                "AverageClassSize": null,
                "DistrictID": "5",
                "Mascot": "Mifflin Mustangs",
                "Uniform": "No",
                "SchoolColors": "Blue and Gold",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/f78ec15a9557400ea02e6928c4c9444417586037975116808532/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18102&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-02-11 10:22:27.000",
                "history": "Mifflin School sits on a hilltop in Lincoln Place in the Thirty-first Ward on the southeastern edge of the city. Mifflin follows the rectilinear central-block-with-front-wings plan. The stepped-back, two-story gymnasium and auditorium wings on each and flow into the tall and narrow central block. At first glance the building appears to be Streamline Moderne, with smooth buff brick walls terminating in elegantly rounded corners. The gymnasium and auditorium doorways are surrounded by wide Egyptian Art Deco borders. The first floor wall curves inward to frame a grand oversized entrance topped by an ornamental tablet framed by abstract flowers. Cloverleafs flipped with floral tracings top wall piers. The walls are not smooth buy reveal patterns of parallel waving lives incised in the exterior brickwork, and the decorative cornices circling the roogs are not flat but rounded. The strange eclecticism of the facade, which grows increasingly wonderful the longer one views it, appears to be a marriage of the Moderne and sixteenth-centery Mannerism which enlarged and exaggerated Classical Renaissance forms. This mixture of contemporary and historical styles is found in the polychromatic auditorium, only here the historical elements recall Georgian neo-classicism. A ceiling of aluminum panels is the principal Art Deco element; Art Deco decoration also appears on the geometric metal air grilles which sport a maple leaf motif. Most of the auditorium is sheathed in wooden paneling - paneled columns are toppd with light blue capitals; green and white medallions and a green scalloped border decorate the white plaster, covering those areas not paneled in wood. White metal chandeliers are trimmed with gold. At the rear of the auditorium white plaster panels framed in wood hold green and white medallions similar to those on the ceiling. The rear exit is surrounded by wooden Classical pilasters and topped with a scrolled pediment. The architectural firm responsible for Mifflin School was Link, Weber & Bowers; the designer, Edward J. Weber (1877-1968)."
            },
            {
                "SchoolID": 157,
                "Direction": "n",
                "ADA": "0",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "morrow",
                "Fax": "4127346606",
                "SchoolDescription": "<p>Pittsburgh Morrow is located in Brighton Heights on the North Side of Pittsburgh; located on two campuses.&nbsp; PreK-4th Grade students are housed in our Primary Campus located on Davis Avenue. Grades 5th &ndash; 8th Grade students are housed in our Intermediate Campus located on Fleming Avenue. Although students from several areas around the city attend our school, we service students primarily from Brighton Heights, Manchester, Northview Heights and Woods Run.&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>Pittsburgh Morrow students are taught the district adopted curriculum in the areas of reading, math, science, social studies, writing, art, music and physical education.</p>\n\n<p>&nbsp;</p>\n\n<p>We are a Title I school which helps to fund additional resources to support all students. &nbsp;Our students are introduced to technology early via First In Math, Study Island, and Read 180, which is used at the 6th and 7th Grade levels.&nbsp; Individual classroom teachers conduct classes in the school computer lab to expose the students to keyboarding skills, internet research, and word processing on the computers.</p>\n\n<p>&nbsp;</p>\n\n<p>Students are encouraged to excel through incentives and recognition for citizenship, honor roll and completion of the 25-Book reading requirement.</p>\n\n<p>&nbsp;</p>\n\n<p>A variety of activities are offered throughout the school year including but not limited to safety patrol, Carnegie Library Outreach, intramurals, Reading is Fundamental book distribution, instrumental music, chorus, and middle grades sports.&nbsp; Students must have a 2.0 grade point average (GPA) and at least a satisfactory mark in all citizenship grades to participate in extracurricular activities.&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>Our mental health partnership with Mercy Behavioral Health allows our students to receive on-site individual and group counseling.&nbsp; In addition, we offer student mediation services via our school counselor. Partnership between parents and the school is encouraged and crucial to the education and development of our students.&nbsp; Opportunities for parental involvement include membership in the Parent Teacher Organization; parent representatives on the school&rsquo;s Parent School Community Council; volunteerism; participation in our quarterly Family Fun Nights, which focus on fun reading and math activities; Take Your Father to School Day, etc.</p>\n\n<p><em><strong>Dress Code:&nbsp;</strong></em>All students are to wear bottoms of any color (no jeans, leggings, jeggings, tights, etc. will be accepted as uniform). Leggings are permitted if appropriate shorts, skorts, a dress, jumper, or a skirt is on top of it.&nbsp; Pants must be worn at the waist.&nbsp; All students are to wear a collared shirt in any color (no t-shirts or un-collared shirts will be accepted as uniform).&nbsp; Socks must be worn at all times.</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Emotional Skills Support Classroom, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "36puph576d0p0diqcs1nnpt0ho@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/John-Morrow-Elementary-School/199235190146373?rf=106276649428547",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "365",
                "SchoolTypeID": "3",
                "AddressLine1": "1611 Davis Ave",
                "AddressLine2": null,
                "SchoolName": "Morrow PreK-8",
                "Zip": "15212",
                "Phone": "4125296600",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:00AM",
                "EndTime": "2:51PM",
                "dwSchoolID": "157",
                "AverageClassSize": null,
                "DistrictID": "9",
                "Mascot": "",
                "Uniform": "Yes. Please refer to school homepage or school handbook for full uniform requirements.",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/c6bb04ac3c094be09d44327bc22d73fc7203261924661230759/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18105&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:43:30.000",
                "history": null
            },
            {
                "SchoolID": 181,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School",
                "SiteUrl": "sunnyside",
                "Fax": "4126652042",
                "SchoolDescription": "<p>Pittsburgh Sunnyside PreK-8 is a neighborhood school located in Pittsburgh&#39;s Stanton Heights community. Based on extraordinary student achievement gains, Pittsburgh Sunnyside PreK-8 has earned the distinguished award of being a STAR, Students and Teachers Achieving Results, school in Pittsburgh Public School District. Pittsburgh Sunnyside provides a safe, healthy and accepting environment where students are encouraged by the school and community to reach their highest levels of achievement. All students have access to computers and iPads to enhance their learning with computer-assisted learning programs such as Compass Learning and First in Math. Pittsburgh Sunnyside PreK-8 has a school-wide Title 1 program, which focuses on student achievement in reading and math as well as parental and community involvement.</p>\n\n<p>&nbsp;</p>\n\n<p>Sunnyside offers an array of opportunities for our students. Our related arts program offers world drumming and keyboarding for grades K-8, as well as instrumental music for grades 4-8. We have a partnership with the Pittsburgh Ballet that provides creative movement classes for our primary grade students. Our 5th grade students learn ballroom dancing and compete in a competition sponsored by Mercy Behavioral Health. Additionally, there is a school play written by one of our teachers every year offering students the opportunity to participate in an on stage production. If sports are an interest, we offer intramurals for our students in grades 4 and 5 and athletic teams for grades 6-8 including: soccer, cross-country, baseball, volleyball and basketball.</p>\n\n<p>&nbsp;</p>\n\n<p>Sunnyside students have the opportunity to participate in various clubs such as ceramic arts, archery, electronics, wellness, culture, and girl talk, during activity periods. We maintain partnerships with FamilyLinks, Mercy Behavioral Health, The Pittsburgh Ballet, the Carnegie Library Blast Program, and Reading for Fundamental (RIF), the Power Up Program, Adagio Health and Carnegie Mellon University. Sunnyside has an after school YMCA Program through the YMCA that is available for students until 6pm on Monday-Friday.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services:</strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regionally Visually Impaired Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "uorq6mksk89fefk29bdfm0qui8@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Pittsburgh-Sunnyside-Pre-K-8/306804929417476?sk=info",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "1",
                "StateID": "7884",
                "SchoolTypeID": "3",
                "AddressLine1": "4801 Stanton Ave",
                "AddressLine2": null,
                "SchoolName": "Sunnyside PreK-8",
                "Zip": "15201",
                "Phone": "4125292040",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:10AM",
                "EndTime": "2:48PM",
                "dwSchoolID": "181",
                "AverageClassSize": null,
                "DistrictID": "2",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/5a38ce1a7aab4670bf93defaf970045615922122668529997522/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18130&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 16:06:18.000",
                "history": null
            }
        ],
        "6-12 Schools": [
            {
                "SchoolID": 304,
                "Direction": "c",
                "ADA": "1",
                "MagnetDesc": "Creative and Performing Arts Magnet",
                "SiteUrl": "capa",
                "Fax": "4123386143",
                "SchoolDescription": "<p>Pittsburgh CAPA 6-12 is a Creative and Performing Arts Magnet school located in the heart of Pittsburgh&#39;s downtown cultural district. In 2009, CAPA was awarded the Blue Ribbon as a school of Distinction by the Department of Education.</p>\n\n<p>The mission of Pittsburgh CAPA 6-12 is to provide every student in grades 6-12 with a comprehensive academic program rooted in a superior quality arts education experience that encourages excellence and success in their personal development as artists and cultural leaders. CAPA 6-12 offers a challenging and integrated curriculum that equally provides world-class preparation for college and university study, and conservatory level preparation for artistic careers.</p>\n\n<p>The environment at CAPA 6-12 is enhanced by partnerships and collaborations with local and national cultural organizations and universities that provide opportunities in which to explore the relationships between school, family and work. In 2014, US News and World Report named CAPA in the Top 20 of Best High Schools in Pennsylvania.</p>\n\n<p>Acceptance is based upon an off-site application and completion of a successful audition or presentation of an acceptable portfolio. Students may choose intensive artistic instruction in one of eight art forms: dance, instrumental music, literary arts, piano, production technology, theater, visual arts and vocal music.&nbsp;<strong>CAPA Audition Materials are available&nbsp;<a href=\"https://www.pghschools.org/caparegistration\">here</a>.</strong></p>\n\n<p>CAPA 6-12 offers National Honor Society, Ski Club, CAPA Chronicle (Newspaper), Unicorn (Yearbook), Student Council, all-school musical, Master classes, Pennsylvania Junior Academy of Science, Amnesty International, intramural sports, African American CAS Council, 6th-8th Grade Athletics (Co-ed Cross Country, Boys and Girls Soccer, Boys and Girls Basketball), and Junior National Honor Society. Students have won awards from the Carson Scholars Fund, National Scholastic Writing Contest, Gene Kelly Awards, Music in the Parks Festival, National Choral Competition, City Theatre Young Playwrights Festival, Pittsburgh Public Theatre&#39;s Shakespeare Contest, National Scholastic Art and Writing Contest, PMEA, and Race to the Top Commencement Challenge.</p>\n\n<p><strong>Advanced Placement Courses Offered:</strong></p>\n\n<p>Biology, Calculus AB, English Language, English Literature, Environmental Science, European History, Physics 2, Psychology, Statistics, US History, and World History.</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": null,
                "StaffWebpageURL": "http://www.pps.k12.pa.us/site/Default.aspx?PageType=1&SiteID=507&ChannelID=545&DirectoryType=6",
                "FacebookURL": "https://www.facebook.com/PGHCAPA",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": "https://www.facebook.com/PGHCAPA",
                "AlumniURL": null,
                "WebsiteURL": null,
                "NewsletterURL": null,
                "StarSchool": "0",
                "StateID": "8106",
                "SchoolTypeID": "5",
                "AddressLine1": "111 9th Street",
                "AddressLine2": null,
                "SchoolName": "CAPA 6-12",
                "Zip": "15222",
                "Phone": "4125296101",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "7:35AM",
                "EndTime": "3:46PM",
                "dwSchoolID": "304",
                "AverageClassSize": null,
                "DistrictID": "8",
                "Mascot": null,
                "Uniform": null,
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/62dcb11b0af4498d891fbf516444c79015757616076274420803/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=121114&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-09-23 19:04:43.773",
                "history": null
            },
            {
                "SchoolID": 309,
                "Direction": "c",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with a University Preparatory Magnet",
                "SiteUrl": "uprep",
                "Fax": "4126225925",
                "SchoolDescription": "<p>Located in Pittsburgh&#39;s historic Hill District, the Pittsburgh Milliones 6-12, University Preparatory School is a neighborhood school that offers an embedded academic Magnet program. Formed by a unique partnership between the University of Pittsburgh and Pittsburgh Public Schools, Pittsburgh Milliones embraces a total college-going culture in and outside of the classroom. Our curriculum is driven by research but molded by each student&#39;s individual goals and abilities, providing each student with the opportunity to discover the value and attainability of post-secondary education. A small school environment provides support for students approaching or above grade level, and our support systems have been designed to help every student at Pittsburgh Milliones complete advanced coursework and succeed. All learners are expected to maintain high academic standards, believe in themselves, and graduate from high school to further their education. This belief, combined with our efforts to acclimate students to university life and introduce them to the possibilities that await them after high school graduation, will motivate students to pursue a college career. Our highly qualified faculty and diverse learning community together demonstrate that a public secondary school can connect all students to a relevant post-secondary opportunity, regardless of their previous academic record, serving as a model of innovation and excellence in urban education devoted to the distinct mission of Excellence for All.</p>\n\n<p>To complement its strong academic programs, University Prep offers a full range of sports reflecting the diversity of our students&#39; interests, including football, baseball, wrestling, boys and girls cross country, soccer, tennis, volleyball and swimming. Students in grades 6-8 have their own sports teams in partnership with the Pittsburgh Science &amp; Technology Academy. Pittsburgh Milliones 6-12 encourages students to support college athletics by providing frequent class field trips to college sporting events. Extracurricular programs include the Student Leadership Team, Computer Science Prep, International Studies Club, History Club, Advanced English Mock Trial, Business Club, University Prep Wildcat Club, and Student Government. A formal scholars dinner and awards ceremony is held annually to honor student achievement in the service of scholarship, academics, athletics, and community service.</p>\n\n<p><strong>Advanced Placement Courses Offered: </strong></p>\n\n<p>Calculus, English 3, English 4, Environmental Science, Human Geography, and World History</p>\n\n<p><strong>CTE Programs Offered:</strong></p>\n\n<p>Entertainment Technology</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "fihpsrpdffhu8eitefvoo3ehq8@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Pittsburgh-Milliones-University-Preparatory-School/113566322026386",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "",
                "StarSchool": "0",
                "StateID": "8110",
                "SchoolTypeID": "5",
                "AddressLine1": "3117 Centre Ave",
                "AddressLine2": null,
                "SchoolName": "Milliones 6-12",
                "Zip": "15219",
                "Phone": "4125295900",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "8:25AM",
                "EndTime": "3:26PM",
                "dwSchoolID": "309",
                "AverageClassSize": null,
                "DistrictID": "3",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/da3234b4534d4f1bb0768c0d9b09027e17050557749874991950/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=121115&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-08-26 15:51:31.000",
                "history": null
            },
            {
                "SchoolID": 312,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "International Baccalaureate Magnet",
                "SiteUrl": "obama",
                "Fax": "4126225983",
                "SchoolDescription": "<p>Pittsburgh Obama 6-12 is an International Baccalaureate World School located in Pittsburgh&#39;s East Liberty neighborhood. The International Baccalaureate Program is recognized worldwide for the rigorous education it provides. All 11th and 12th grade students at the Obama Academy are enrolled in IB Diploma Program classes, which are college level classes taught over a two-year span. Obama Academy students have the option to sit for oral and written examinations in each of the Diploma Program classes they take to obtain college credit. Students who score well on examinations in 6 core areas, document a significant number of hours of extracurricular activities, and write additional papers, can earn an IB Diploma. Many colleges and universities allow students who earn the IB Diploma to skip their freshman year entirely. To prepare students for the challenges of the Diploma Program, 6th through 10th grade students participate in the Middle Years Program. In the Middle Years Program, teachers add to the standard Pittsburgh Public School curriculum to provide students with the skills and background knowledge necessary to succeed in the Diploma Program classes by focusing on holistic learning, intercultural understanding and communication. All Obama Academy students in grades 6 through 12 have one period of foreign language instruction every day. Students must be committed to documenting extracurricular community service, action and creativity activities.</p>\n\n<p>&nbsp;</p>\n\n<p>All sports available to Pittsburgh Public School students are offered at the Obama Academy. Extracurricular activities include National Junior BETA Club, National Honor Society, Youth and Government, Student Ambassadors, Student Council, PA Junior Academy of Science, World Drumming Ensemble, Chorus, Library Club, Steel Drum Band, Musicals, One Act Plays, Orchestra, Concert Band, Marching Band, school newspaper (obamaeagle.org), Interact Club, Charles Drew Science Competition, Black History Art and Essay Contest, Ski Club, All City Art Competition, All City Music Festival, Teen Forums, Future Programmers Club, Language Clubs, Chess Club, Cheerleading, and Drill Teams, Pittsburgh Regional Science Fair, PPS City Science Exposition, Creek Connections, Project THINK, Math League, and Intramural Sports. There are also collaborative partnerships with Pitt Honors College, CMU Chemistry and Biomedical Engineering programs, Gateway to the Arts and Pittsburgh Ballet Theater and other area colleges and universities.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>International Baccalaureate Courses Offered: </strong></p>\n\n<p>English, French, Japanese, Spanish, German, History of the Americans, Theory of Knowledge, Mathematics, Mathematical Students, Theatre, Film, Visual Arts, Music, Physics, Biology, Chemistry</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy, Regional Life Skills Support Classroom, Regional Autistic Support Classroom</p>\n\n<p>&nbsp;</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "e6esv6555a5tiu3ost6p23uv6o@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "https://www.facebook.com/pages/Pittsburgh-Obama-6-12-PTO/158618524167171",
                "AlumniURL": "",
                "WebsiteURL": "http://www.pps.k12.pa.us/ibworld2",
                "NewsletterURL": "http://www.obamaeagle.org",
                "StarSchool": "0",
                "StateID": "8105",
                "SchoolTypeID": "5",
                "AddressLine1": "515 N. Highland Avenue",
                "AddressLine2": null,
                "SchoolName": "Obama 6-12",
                "Zip": "15206",
                "Phone": "4125295980",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "7:36AM",
                "EndTime": "3:51PM",
                "dwSchoolID": "312",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": "",
                "Uniform": "",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/14104755af844c589df4c30d032e3ca9354726360408702691/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=121113&a=28&b=138",
                "created_at": null,
                "updated_at": "2018-09-27 15:44:16.000",
                "history": null
            },
            {
                "SchoolID": 306,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Science Technology Engineering and Mathematics Magnet",
                "SiteUrl": "scitech",
                "Fax": "4126225991",
                "SchoolDescription": "<p>Our curriculum is tailored to students who have a passion for science, technology, engineering or math. Our environment is one of support for students, parents, and faculty. We exist to provide opportunities for students to Dream. Discover. Design. Every day, our students set goals and generate ideas, research and discover answers, and design real solutions for the kinds of real-world problems that they&#39;ll face after graduation. There is plenty of support for anyone who needs it and advancement opportunities for those who are ready to move ahead. An innovative schedule provides each student the time and support necessary to prepare for their advanced courses. We have a 1 to 1 laptop program for students.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Advanced Placement Courses Offered: </strong></p>\n\n<p>Biology, Calculus, Computer Science, English Language, English Literature, Environmental Science, Physics 1, Physics C: Mechanics, Statistics, Studio Art, US History</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>",
                "SchoolAlertBox": null,
                "GoogleCalendarID": "bgd4ofb0kk0lel1rnb89u8jtug@group.calendar.google.com",
                "StaffWebpageURL": null,
                "FacebookURL": "https://www.facebook.com/pittsburghscitech/",
                "TwitterURL": null,
                "InstagramURL": null,
                "YouTubeURL": null,
                "GoogleURL": null,
                "PTOURL": "http://scitechpto.org/",
                "AlumniURL": null,
                "WebsiteURL": "http://pittsburghscitech.com/",
                "NewsletterURL": "http://visitor.r20.constantcontact.com/d.jsp?llr=qo6l5erab&p=oi&m=1117931304400&sit=qcex767ib&f=4b5e0624-4eaf-4e84-9802-d62618a3ed7f",
                "StarSchool": "0",
                "StateID": "8107",
                "SchoolTypeID": "5",
                "AddressLine1": "107 Thackeray St",
                "AddressLine2": null,
                "SchoolName": "Science And Technology Academy",
                "Zip": "15213",
                "Phone": "4125297620",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "1",
                "StartTime": "7:36AM",
                "EndTime": "2:46PM",
                "dwSchoolID": "306",
                "AverageClassSize": null,
                "DistrictID": "3",
                "Mascot": null,
                "Uniform": "Polo or collared dress shirt, denim jeans or dress pants - any color, t-shirts and long sleeve shirts, hoodies and fleeces, any shoes other than sandals, flip flops, cleats or slippers. Skirts and dresses at or below the knee.",
                "SchoolColors": null,
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/1143bf009aa94b48a635454f8f2e33163501785173061816018/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=121112&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-10-04 13:51:06.337",
                "history": null
            },
            {
                "SchoolID": 356,
                "Direction": "e",
                "ADA": "1",
                "MagnetDesc": "Neighborhood School with CTE Offerings",
                "SiteUrl": "westinghouse",
                "Fax": "4126654977",
                "SchoolDescription": "<p>Pittsburgh Westinghouse Academy 6-12 is a comprehensive 6-12 neighborhood school located in Pittsburgh&#39;s Homewood community that offers a variety of courses to meet the needs, abilities, and interests of its approximately 500 students. Westinghouse is proud of its rich history in the City of Pittsburgh. The purpose and commitment of Westinghouse Academy 6-12 is to provide a quality educational program for all of our students. Westinghouse not only is fully committed to the advancement of the students academically, but we are fully aware of the need to provide our students with relevant and comprehensive social development. Pittsburgh Westinghouse Academy 6-12 currently offers five Career and Technical Education comprehensive programs. All of the Career and Technical Education programs are fully accredited with Pennsylvania State and licensure/certification. Students who participate in these programs receive industry recognized training, professional development, internships, community service, field placements and job placement opportunities.</p>\n\n<p>Currently Pittsburgh Westinghouse has the following varsity sports teams: Football, Girls Basketball, Boys Basketball, Boys Volleyball, Girls Volleyball, Co-ed Cross country, Boys Tennis, Boys Soccer, Co-ed Wrestling, Girls Softball, Boys Baseball, Boys Track, and Girls Track. Pittsburgh Westinghouse Academy 6-12 currently collaborates with over 45 colleges, universities, community organizations, agencies, churches, and hospitals. The partnerships currently provide mentoring, community services, workforce development opportunities, tutoring, college preparatory classes, and certification/licensures. Partnerships are currently established with the following agencies: Urban League of Greater Pittsburgh, Heinz, NEED, CORO, Homewood Children&#39;s Village, Addison Behavioral Care, UPMC PHAT program, YMCA, YWCA, East End Cooperative Ministries, Wesley Spectrum, Family Links, Centers for Victims of Violent Crimes, University of Pittsburgh, City of Pittsburgh Police Department, Mt. Ararat, Future Educators of America, Children&#39;s Hospital, Community Empowerment, Greater Valley Community Services, AmeriCorps, and University of Pittsburgh Social Work Interns just to name a few.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Advanced Placement Courses Offered:</strong></p>\n\n<p>Biology, English 3, English 4</p>\n\n<p>&nbsp;</p>\n\n<p><strong>CTE Programs Offered:</strong></p>\n\n<p>Business Administration, ERT program, Sports &amp; Entertainment, Carpentry, Cosmetology, Culinary Arts, Health Careers</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Additional Educational Services: </strong></p>\n\n<p>Learning Support, Speech &amp; Language, Itinerant Hearing and Vision, Autistic Support, Emotional Support, Occupation Therapy and Physical Therapy</p>\n",
                "SchoolAlertBox": "",
                "GoogleCalendarID": "r3np9q0io152d6uo6qvnvelfi4@group.calendar.google.com",
                "StaffWebpageURL": "",
                "FacebookURL": "https://www.facebook.com/pages/Westinghouse-High-School/105734982794151",
                "TwitterURL": "",
                "InstagramURL": "",
                "YouTubeURL": "",
                "GoogleURL": "",
                "PTOURL": "",
                "AlumniURL": "",
                "WebsiteURL": "",
                "NewsletterURL": "https://visitor.r20.constantcontact.com/manage/optin?v=001_BS31v9uBHq5zmmvyIP72Dm3FgcbUSqC5RvLXZQstryhi5lP6SxYACG9mF46H5Nk61nPMqoqgBr0XeaNvfjwmzxen51y6ahHjH_S6FSmV8U%3D",
                "StarSchool": "0",
                "StateID": "8203",
                "SchoolTypeID": "5",
                "AddressLine1": "1101 North Murtland Avenue",
                "AddressLine2": null,
                "SchoolName": "Westinghouse Academy 6-12",
                "Zip": "15208",
                "Phone": "4125293940",
                "State": "PA",
                "City": "Pittsburgh",
                "MagnetInd": "0",
                "StartTime": "7:36AM",
                "EndTime": "3:16PM",
                "dwSchoolID": "356",
                "AverageClassSize": null,
                "DistrictID": "1",
                "Mascot": "",
                "Uniform": "Solid khaki tan or navy blue pants/skirts/jumpers/cargo/shorts. Blue, Yellow, or White  Polo or Oxford button-down shirts with a collar, short-sleeve or long –sleeve",
                "SchoolColors": "",
                "vimeoID": "0",
                "CalendarType": "outlook",
                "OutlookURL": "https://outlook.office365.com/owa/calendar/9bc98b6dff8843978bfc50a53025cfa6@pghschools.org/3067362656cf4f558106c70bafde0ab71995281124270857684/calendar.ics",
                "PeachjarURL": "https://www.peachjar.com/index.php?region=18135&a=28&b=138",
                "created_at": null,
                "updated_at": "2019-07-19 07:47:46.000",
                "history": "Westinghouse School was to have been designed by George Orth in 1916, but World War I and Orth's death in 1918 intervened. the building was designed in 1921 by the Pittsburgh firm of Ingham & Boyd; built in stages, the building was not completed until 1931. Like Schenley and Taylor Allderdice High Schools, Westinghouse has a Classical detailing. The National Register nomination form notes: \"the school's Classicism is merely a skin over a utilitarian modern school plant, designed to efficiently educat, not edify, the students.\" The school is named for George Westinghouse, the brilliant inventor who arrived in Pittsburgh in 1868. He invented the air brake for railcars and was responsible for developing the alternating current system. "
            }
        ]
    }
}